using System.Linq;
using System.Collections.Generic;
using System.Text;

namespace Pokemon3genRNGLibrary.MapData
{
    public static class EmMapData
    {
        public static class Field
        {
            public static GBAMap[] SelectMap(string mapNameKeyWord = "")
                => tables.Where(_ => _.MapName.Contains(mapNameKeyWord)).ToArray();


            private static readonly GBAMap[] tables;
            static Field()
            {
                tables = new GBAMap[]
                {
                new EmGrass("101ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ケムッソ", 2),
                    ("ポチエナ", 2),
                    ("ケムッソ", 2),
                    ("ケムッソ", 3),
                    ("ポチエナ", 3),
                    ("ポチエナ", 3),
                    ("ケムッソ", 3),
                    ("ポチエナ", 3),
                    ("ジグザグマ", 2),
                    ("ジグザグマ", 2),
                    ("ジグザグマ", 3),
                    ("ジグザグマ", 3),
                })),
                new EmGrass("102ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ポチエナ", 3),
                    ("ケムッソ", 3),
                    ("ポチエナ", 4),
                    ("ケムッソ", 4),
                    ("ハスボー", 3),
                    ("ハスボー", 4),
                    ("ジグザグマ", 3),
                    ("ジグザグマ", 3),
                    ("ジグザグマ", 4),
                    ("ラルトス", 4),
                    ("ジグザグマ", 4),
                    ("タネボー", 3),
                })),
                new EmGrass("103ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ポチエナ", 2),
                    ("ポチエナ", 3),
                    ("ポチエナ", 3),
                    ("ポチエナ", 4),
                    ("キャモメ", 2),
                    ("ジグザグマ", 3),
                    ("ジグザグマ", 3),
                    ("ジグザグマ", 4),
                    ("キャモメ", 3),
                    ("キャモメ", 3),
                    ("キャモメ", 2),
                    ("キャモメ", 4),
                })),
                new EmGrass("104ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ポチエナ", 4),
                    ("ケムッソ", 4),
                    ("ポチエナ", 5),
                    ("マリル", 5),
                    ("マリル", 4),
                    ("ポチエナ", 5),
                    ("スバメ", 4),
                    ("スバメ", 5),
                    ("キャモメ", 4),
                    ("キャモメ", 4),
                    ("キャモメ", 3),
                    ("キャモメ", 5),
                })),
                new EmGrass("110ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ポチエナ", 12),
                    ("ラクライ", 12),
                    ("ゴクリン", 12),
                    ("ラクライ", 13),
                    ("マイナン", 13),
                    ("ナゾノクサ", 13),
                    ("マイナン", 13),
                    ("ゴクリン", 13),
                    ("キャモメ", 12),
                    ("キャモメ", 12),
                    ("プラスル", 12),
                    ("プラスル", 13),
                })),
                new EmGrass("111ばんどうろ", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("サンド", 20),
                    ("ナックラー", 20),
                    ("サンド", 21),
                    ("ナックラー", 21),
                    ("ヤジロン", 19),
                    ("ヤジロン", 21),
                    ("サンド", 19),
                    ("ナックラー", 19),
                    ("ヤジロン", 20),
                    ("サボネア", 20),
                    ("サボネア", 22),
                    ("サボネア", 22),
                })),
                new EmGrass("112ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ドンメル", 15),
                    ("ドンメル", 15),
                    ("マリル", 15),
                    ("ドンメル", 14),
                    ("ドンメル", 14),
                    ("マリル", 14),
                    ("ドンメル", 16),
                    ("マリル", 16),
                    ("ドンメル", 16),
                    ("ドンメル", 16),
                    ("ドンメル", 16),
                    ("ドンメル", 16),
                })),
                new EmGrass("113ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("パッチール", 15),
                    ("パッチール", 15),
                    ("マグマッグ", 15),
                    ("パッチール", 14),
                    ("パッチール", 14),
                    ("マグマッグ", 14),
                    ("パッチール", 16),
                    ("マグマッグ", 16),
                    ("パッチール", 16),
                    ("エアームド", 16),
                    ("パッチール", 16),
                    ("エアームド", 16),
                })),
                new EmGrass("114ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("チルット", 16),
                    ("ハスボー", 16),
                    ("チルット", 17),
                    ("チルット", 15),
                    ("ハスボー", 15),
                    ("ハスブレロ", 16),
                    ("ハスブレロ", 16),
                    ("ハスブレロ", 18),
                    ("ハブネーク", 17),
                    ("ハブネーク", 15),
                    ("ハブネーク", 17),
                    ("コノハナ", 15),
                })),
                new EmGrass("115ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("チルット", 23),
                    ("スバメ", 23),
                    ("チルット", 25),
                    ("スバメ", 24),
                    ("スバメ", 25),
                    ("オオスバメ", 25),
                    ("プリン", 24),
                    ("プリン", 25),
                    ("キャモメ", 24),
                    ("キャモメ", 24),
                    ("キャモメ", 26),
                    ("キャモメ", 25),
                })),
                new EmGrass("116ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ポチエナ", 6),
                    ("ゴニョニョ", 6),
                    ("ツチニン", 6),
                    ("ケーシィ", 7),
                    ("ツチニン", 7),
                    ("スバメ", 6),
                    ("スバメ", 7),
                    ("スバメ", 8),
                    ("ポチエナ", 7),
                    ("ポチエナ", 8),
                    ("エネコ", 7),
                    ("エネコ", 8),
                })),
                new EmGrass("117ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ポチエナ", 13),
                    ("ナゾノクサ", 13),
                    ("ポチエナ", 14),
                    ("ナゾノクサ", 14),
                    ("マリル", 13),
                    ("ナゾノクサ", 13),
                    ("イルミーゼ", 13),
                    ("イルミーゼ", 13),
                    ("イルミーゼ", 14),
                    ("イルミーゼ", 14),
                    ("バルビート", 13),
                    ("タネボー", 13),
                })),
                new EmGrass("118ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ジグザグマ", 24),
                    ("ラクライ", 24),
                    ("ジグザグマ", 26),
                    ("ラクライ", 26),
                    ("マッスグマ", 26),
                    ("ライボルト", 26),
                    ("キャモメ", 25),
                    ("キャモメ", 25),
                    ("キャモメ", 26),
                    ("キャモメ", 26),
                    ("キャモメ", 27),
                    ("カクレオン", 25),
                })),
                new EmGrass("119ばんどうろ", 15, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ジグザグマ", 25),
                    ("マッスグマ", 25),
                    ("ジグザグマ", 27),
                    ("ナゾノクサ", 25),
                    ("マッスグマ", 27),
                    ("ナゾノクサ", 26),
                    ("ナゾノクサ", 27),
                    ("ナゾノクサ", 24),
                    ("トロピウス", 25),
                    ("トロピウス", 26),
                    ("トロピウス", 27),
                    ("カクレオン", 25),
                })),
                new EmGrass("120ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ポチエナ", 25),
                    ("グラエナ", 25),
                    ("グラエナ", 27),
                    ("ナゾノクサ", 25),
                    ("マリル", 25),
                    ("ナゾノクサ", 26),
                    ("ナゾノクサ", 27),
                    ("マリル", 27),
                    ("アブソル", 25),
                    ("アブソル", 27),
                    ("カクレオン", 25),
                    ("タネボー", 25),
                })),
                new EmGrass("121ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ポチエナ", 26),
                    ("カゲボウズ", 26),
                    ("グラエナ", 26),
                    ("カゲボウズ", 28),
                    ("グラエナ", 28),
                    ("ナゾノクサ", 26),
                    ("ナゾノクサ", 28),
                    ("クサイハナ", 28),
                    ("キャモメ", 26),
                    ("キャモメ", 27),
                    ("キャモメ", 28),
                    ("カクレオン", 25),
                })),
                new EmGrass("123ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ポチエナ", 26),
                    ("カゲボウズ", 26),
                    ("グラエナ", 26),
                    ("カゲボウズ", 28),
                    ("グラエナ", 28),
                    ("ナゾノクサ", 26),
                    ("ナゾノクサ", 28),
                    ("クサイハナ", 28),
                    ("キャモメ", 26),
                    ("キャモメ", 27),
                    ("キャモメ", 28),
                    ("カクレオン", 25),
                })),
                new EmGrass("トウカのもり", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ポチエナ", 5),
                    ("ケムッソ", 5),
                    ("キノココ", 5),
                    ("ポチエナ", 6),
                    ("カラサリス", 5),
                    ("マユルド", 5),
                    ("ケムッソ", 6),
                    ("キノココ", 6),
                    ("スバメ", 5),
                    ("ナマケロ", 5),
                    ("スバメ", 6),
                    ("ナマケロ", 6),
                })),
                new EmGrass("カナシダトンネル", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴニョニョ", 6),
                    ("ゴニョニョ", 7),
                    ("ゴニョニョ", 6),
                    ("ゴニョニョ", 6),
                    ("ゴニョニョ", 7),
                    ("ゴニョニョ", 7),
                    ("ゴニョニョ", 5),
                    ("ゴニョニョ", 8),
                    ("ゴニョニョ", 5),
                    ("ゴニョニョ", 8),
                    ("ゴニョニョ", 5),
                    ("ゴニョニョ", 8),
                })),
                new EmGrass("いしのどうくつ 1F", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ズバット", 7),
                    ("マクノシタ", 8),
                    ("マクノシタ", 7),
                    ("ズバット", 8),
                    ("マクノシタ", 9),
                    ("ケーシィ", 8),
                    ("マクノシタ", 10),
                    ("マクノシタ", 6),
                    ("イシツブテ", 7),
                    ("イシツブテ", 8),
                    ("イシツブテ", 6),
                    ("イシツブテ", 9),
                })),
                new EmGrass("いしのどうくつ B1F", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ズバット", 9),
                    ("ココドラ", 10),
                    ("ココドラ", 9),
                    ("ココドラ", 11),
                    ("ズバット", 10),
                    ("ケーシィ", 9),
                    ("マクノシタ", 10),
                    ("マクノシタ", 11),
                    ("ヤミラミ", 10),
                    ("ヤミラミ", 10),
                    ("ヤミラミ", 9),
                    ("ヤミラミ", 11),
                })),
                new EmGrass("いしのどうくつ B2F", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ズバット", 10),
                    ("ココドラ", 11),
                    ("ココドラ", 10),
                    ("ズバット", 11),
                    ("ココドラ", 12),
                    ("ケーシィ", 10),
                    ("ヤミラミ", 10),
                    ("ヤミラミ", 11),
                    ("ヤミラミ", 12),
                    ("ヤミラミ", 10),
                    ("ヤミラミ", 12),
                    ("ヤミラミ", 10),
                })),
                new EmGrass("いしのどうくつ 小部屋", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ズバット", 7),
                    ("マクノシタ", 8),
                    ("マクノシタ", 7),
                    ("ズバット", 8),
                    ("マクノシタ", 9),
                    ("ケーシィ", 8),
                    ("マクノシタ", 10),
                    ("マクノシタ", 6),
                    ("ココドラ", 7),
                    ("ココドラ", 8),
                    ("ココドラ", 7),
                    ("ココドラ", 8),
                })),
                new EmGrass("ニューキンセツ 入口", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ビリリダマ", 24),
                    ("コイル", 24),
                    ("ビリリダマ", 25),
                    ("コイル", 25),
                    ("ビリリダマ", 23),
                    ("コイル", 23),
                    ("ビリリダマ", 26),
                    ("コイル", 26),
                    ("ビリリダマ", 22),
                    ("コイル", 22),
                    ("ビリリダマ", 22),
                    ("コイル", 22),
                })),
                new EmGrass("ニューキンセツ 地下", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ビリリダマ", 24),
                    ("コイル", 24),
                    ("ビリリダマ", 25),
                    ("コイル", 25),
                    ("ビリリダマ", 23),
                    ("コイル", 23),
                    ("ビリリダマ", 26),
                    ("コイル", 26),
                    ("ビリリダマ", 22),
                    ("コイル", 22),
                    ("マルマイン", 26),
                    ("レアコイル", 26),
                })),
                new EmGrass("ほのおのぬけみち", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ドンメル", 15),
                    ("ドガース", 15),
                    ("ドンメル", 16),
                    ("ワンリキー", 15),
                    ("コータス", 15),
                    ("マグマッグ", 15),
                    ("ドガース", 16),
                    ("ワンリキー", 16),
                    ("コータス", 14),
                    ("コータス", 16),
                    ("ベトベター", 14),
                    ("ベトベター", 14),
                })),
                new EmGrass("デコボコさんどう", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ドンメル", 21),
                    ("ドンメル", 21),
                    ("ワンリキー", 21),
                    ("ドンメル", 20),
                    ("バネブー", 20),
                    ("ワンリキー", 20),
                    ("バネブー", 21),
                    ("ワンリキー", 22),
                    ("ドンメル", 22),
                    ("バネブー", 22),
                    ("ドンメル", 22),
                    ("バネブー", 22),
                })),
                new EmGrass("マグマだんアジト", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("イシツブテ", 27),
                    ("コータス", 28),
                    ("イシツブテ", 28),
                    ("コータス", 30),
                    ("イシツブテ", 29),
                    ("イシツブテ", 30),
                    ("イシツブテ", 30),
                    ("ゴローン", 30),
                    ("ゴローン", 30),
                    ("ゴローン", 31),
                    ("ゴローン", 32),
                    ("ゴローン", 33),
                })),
                new EmGrass("げんえいのとう", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("サンド", 21),
                    ("ナックラー", 21),
                    ("サンド", 20),
                    ("ナックラー", 20),
                    ("サンド", 20),
                    ("ナックラー", 20),
                    ("サンド", 22),
                    ("ナックラー", 22),
                    ("サンド", 23),
                    ("ナックラー", 23),
                    ("サンド", 24),
                    ("ナックラー", 24),
                })),
                new EmGrass("りゅうせいのたき 入口", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ズバット", 16),
                    ("ズバット", 17),
                    ("ズバット", 18),
                    ("ズバット", 15),
                    ("ズバット", 14),
                    ("ソルロック", 16),
                    ("ソルロック", 18),
                    ("ソルロック", 14),
                    ("ズバット", 19),
                    ("ズバット", 20),
                    ("ズバット", 19),
                    ("ズバット", 20),
                })),
                new EmGrass("りゅうせいのたき 奥", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴルバット", 33),
                    ("ゴルバット", 35),
                    ("ゴルバット", 33),
                    ("ソルロック", 35),
                    ("ソルロック", 33),
                    ("ソルロック", 37),
                    ("ゴルバット", 35),
                    ("ソルロック", 39),
                    ("ゴルバット", 38),
                    ("ゴルバット", 40),
                    ("ゴルバット", 38),
                    ("ゴルバット", 40),
                })),
                new EmGrass("りゅうせいのたき 最奥", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴルバット", 33),
                    ("ゴルバット", 35),
                    ("タツベイ", 30),
                    ("ソルロック", 35),
                    ("タツベイ", 35),
                    ("ソルロック", 37),
                    ("タツベイ", 25),
                    ("ソルロック", 39),
                    ("ゴルバット", 38),
                    ("ゴルバット", 40),
                    ("ゴルバット", 38),
                    ("ゴルバット", 40),
                })),
                new EmGrass("おくりびやま 1F-3F", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("カゲボウズ", 27),
                    ("カゲボウズ", 28),
                    ("カゲボウズ", 26),
                    ("カゲボウズ", 25),
                    ("カゲボウズ", 29),
                    ("カゲボウズ", 24),
                    ("カゲボウズ", 23),
                    ("カゲボウズ", 22),
                    ("カゲボウズ", 29),
                    ("カゲボウズ", 24),
                    ("カゲボウズ", 29),
                    ("カゲボウズ", 24),
                })),
                new EmGrass("おくりびやま 4F-6F", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("カゲボウズ", 27),
                    ("カゲボウズ", 28),
                    ("カゲボウズ", 26),
                    ("カゲボウズ", 25),
                    ("カゲボウズ", 29),
                    ("カゲボウズ", 24),
                    ("カゲボウズ", 23),
                    ("カゲボウズ", 22),
                    ("ヨマワル", 27),
                    ("ヨマワル", 27),
                    ("ヨマワル", 25),
                    ("ヨマワル", 29),
                })),
                new EmGrass("おくりびやま 外", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("カゲボウズ", 27),
                    ("カゲボウズ", 27),
                    ("カゲボウズ", 28),
                    ("カゲボウズ", 29),
                    ("ロコン", 29),
                    ("ロコン", 27),
                    ("ロコン", 29),
                    ("ロコン", 25),
                    ("キャモメ", 27),
                    ("キャモメ", 27),
                    ("キャモメ", 26),
                    ("キャモメ", 28),
                })),
                new EmGrass("おくりびやま 頂上", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("カゲボウズ", 28),
                    ("カゲボウズ", 29),
                    ("カゲボウズ", 27),
                    ("カゲボウズ", 26),
                    ("カゲボウズ", 30),
                    ("カゲボウズ", 25),
                    ("カゲボウズ", 24),
                    ("ヨマワル", 28),
                    ("ヨマワル", 26),
                    ("ヨマワル", 30),
                    ("チリーン", 28),
                    ("チリーン", 28),
                })),
                new EmGrass("あさせのほらあな", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ズバット", 26),
                    ("タマザラシ", 26),
                    ("ズバット", 28),
                    ("タマザラシ", 28),
                    ("ズバット", 30),
                    ("タマザラシ", 30),
                    ("ズバット", 32),
                    ("タマザラシ", 32),
                    ("ゴルバット", 32),
                    ("タマザラシ", 32),
                    ("ゴルバット", 32),
                    ("タマザラシ", 32),
                })),
                new EmGrass("あさせのほらあな 氷エリア", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ズバット", 26),
                    ("タマザラシ", 26),
                    ("ズバット", 28),
                    ("タマザラシ", 28),
                    ("ズバット", 30),
                    ("タマザラシ", 30),
                    ("ユキワラシ", 26),
                    ("タマザラシ", 32),
                    ("ゴルバット", 30),
                    ("ユキワラシ", 28),
                    ("ゴルバット", 32),
                    ("ユキワラシ", 30),
                })),
                new EmGrass("かいていどうくつ", 4, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ズバット", 30),
                    ("ズバット", 31),
                    ("ズバット", 32),
                    ("ズバット", 33),
                    ("ズバット", 28),
                    ("ズバット", 29),
                    ("ズバット", 34),
                    ("ズバット", 35),
                    ("ゴルバット", 34),
                    ("ゴルバット", 35),
                    ("ゴルバット", 33),
                    ("ゴルバット", 36),
                })),
                new EmGrass("めざめのほこら 入口", 4, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ズバット", 30),
                    ("ズバット", 31),
                    ("ズバット", 32),
                    ("ズバット", 33),
                    ("ズバット", 28),
                    ("ズバット", 29),
                    ("ズバット", 34),
                    ("ズバット", 35),
                    ("ゴルバット", 34),
                    ("ゴルバット", 35),
                    ("ゴルバット", 33),
                    ("ゴルバット", 36),
                })),
                new EmGrass("めざめのほこら 1F-B3F", 4, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ズバット", 30),
                    ("ズバット", 31),
                    ("ズバット", 32),
                    ("ヤミラミ", 30),
                    ("ヤミラミ", 32),
                    ("ヤミラミ", 34),
                    ("ズバット", 33),
                    ("ズバット", 34),
                    ("ゴルバット", 34),
                    ("ゴルバット", 35),
                    ("ゴルバット", 33),
                    ("ゴルバット", 36),
                })),
                new EmGrass("チャンピオンロード 1F", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴルバット", 40),
                    ("ハリテヤマ", 40),
                    ("コドラ", 40),
                    ("ドゴーム", 40),
                    ("ズバット", 36),
                    ("マクノシタ", 36),
                    ("ゴルバット", 38),
                    ("ハリテヤマ", 38),
                    ("ココドラ", 36),
                    ("ゴニョニョ", 36),
                    ("ココドラ", 36),
                    ("ゴニョニョ", 36),
                })),
                new EmGrass("チャンピオンロード B1F", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴルバット", 40),
                    ("ハリテヤマ", 40),
                    ("コドラ", 40),
                    ("コドラ", 40),
                    ("ゴルバット", 38),
                    ("ハリテヤマ", 38),
                    ("ゴルバット", 42),
                    ("ハリテヤマ", 42),
                    ("コドラ", 42),
                    ("クチート", 38),
                    ("コドラ", 42),
                    ("クチート", 38),
                })),
                new EmGrass("チャンピオンロード B2F", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴルバット", 40),
                    ("ヤミラミ", 40),
                    ("コドラ", 40),
                    ("コドラ", 40),
                    ("ゴルバット", 42),
                    ("ヤミラミ", 42),
                    ("ゴルバット", 44),
                    ("ヤミラミ", 44),
                    ("コドラ", 42),
                    ("クチート", 42),
                    ("コドラ", 44),
                    ("クチート", 44),
                })),
                new EmGrass("そらのはしら 1F", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ヤミラミ", 33),
                    ("ゴルバット", 34),
                    ("ゴルバット", 35),
                    ("ヤミラミ", 34),
                    ("ネンドール", 36),
                    ("ジュペッタ", 37),
                    ("ジュペッタ", 38),
                    ("ネンドール", 36),
                    ("ネンドール", 37),
                    ("ネンドール", 38),
                    ("ネンドール", 37),
                    ("ネンドール", 38),
                })),
                new EmGrass("そらのはしら 3F", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ヤミラミ", 33),
                    ("ゴルバット", 34),
                    ("ゴルバット", 35),
                    ("ヤミラミ", 34),
                    ("ネンドール", 36),
                    ("ジュペッタ", 37),
                    ("ジュペッタ", 38),
                    ("ネンドール", 36),
                    ("ネンドール", 37),
                    ("ネンドール", 38),
                    ("ネンドール", 37),
                    ("ネンドール", 38),
                })),
                new EmGrass("そらのはしら 5F", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ヤミラミ", 33),
                    ("ゴルバット", 34),
                    ("ゴルバット", 35),
                    ("ヤミラミ", 34),
                    ("ネンドール", 36),
                    ("ジュペッタ", 37),
                    ("ジュペッタ", 38),
                    ("ネンドール", 36),
                    ("ネンドール", 37),
                    ("チルタリス", 38),
                    ("チルタリス", 39),
                    ("チルタリス", 39),
                })),
                new EmSafariGrass("サファリゾーン 入口エリア", 25, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ナゾノクサ", 25),
                    ("ナゾノクサ", 27),
                    ("キリンリキ", 25),
                    ("キリンリキ", 27),
                    ("ネイティ", 25),
                    ("ドードー", 25),
                    ("クサイハナ", 25),
                    ("ソーナンス", 27),
                    ("ピカチュウ", 25),
                    ("ソーナンス", 27),
                    ("ピカチュウ", 27),
                    ("ソーナンス", 29),
                })),
                new EmSafariGrass("サファリゾーン 西エリア", 25, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ナゾノクサ", 25),
                    ("ナゾノクサ", 27),
                    ("キリンリキ", 25),
                    ("キリンリキ", 27),
                    ("ネイティ", 25),
                    ("ドードー", 27),
                    ("クサイハナ", 25),
                    ("ソーナンス", 27),
                    ("ピカチュウ", 25),
                    ("ソーナンス", 27),
                    ("ピカチュウ", 27),
                    ("ソーナンス", 29),
                })),
                new EmSafariGrass("サファリゾーン マッハエリア", 25, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("サイホーン", 27),
                    ("ナゾノクサ", 27),
                    ("サイホーン", 29),
                    ("ナゾノクサ", 29),
                    ("ドードー", 27),
                    ("クサイハナ", 29),
                    ("クサイハナ", 31),
                    ("ドードー", 29),
                    ("ドードリオ", 29),
                    ("カイロス", 27),
                    ("ドードリオ", 31),
                    ("カイロス", 29),
                })),
                new EmSafariGrass("サファリゾーン ダートエリア", 25, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴマゾウ", 27),
                    ("ナゾノクサ", 27),
                    ("ゴマゾウ", 29),
                    ("ナゾノクサ", 29),
                    ("ネイティ", 27),
                    ("クサイハナ", 29),
                    ("クサイハナ", 31),
                    ("ネイティ", 29),
                    ("ネイティオ", 29),
                    ("ヘラクロス", 27),
                    ("ネイティオ", 31),
                    ("ヘラクロス", 29),
                })),
                new EmSafariGrass("サファリゾーン 追加エリア北", 25, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("エイパム", 33),
                    ("ヒメグマ", 34),
                    ("エイパム", 35),
                    ("ヒメグマ", 36),
                    ("ヒマナッツ", 34),
                    ("レディバ", 33),
                    ("ホーホー", 35),
                    ("クヌギダマ", 34),
                    ("デルビル", 36),
                    ("ミルタンク", 37),
                    ("デルビル", 39),
                    ("ミルタンク", 40),
                })),
                new EmSafariGrass("サファリゾーン 追加エリア南", 25, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ヒマナッツ", 33),
                    ("メリープ", 34),
                    ("ヒマナッツ", 35),
                    ("メリープ", 36),
                    ("エイパム", 34),
                    ("イトマル", 33),
                    ("ホーホー", 35),
                    ("ブルー", 34),
                    ("オドシシ", 36),
                    ("グライガー", 37),
                    ("オドシシ", 39),
                    ("グライガー", 40),
                })),
                new EmGrass("へんげのどうくつ", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ズバット", 10),
                    ("ズバット", 12),
                    ("ズバット", 8),
                    ("ズバット", 14),
                    ("ズバット", 10),
                    ("ズバット", 12),
                    ("ズバット", 16),
                    ("ズバット", 6),
                    ("ズバット", 8),
                    ("ズバット", 14),
                    ("ズバット", 8),
                    ("ズバット", 14),
                })),
                new EmGrass("マボロシじま", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ソーナノ", 30),
                    ("ソーナノ", 35),
                    ("ソーナノ", 25),
                    ("ソーナノ", 40),
                    ("ソーナノ", 20),
                    ("ソーナノ", 45),
                    ("ソーナノ", 15),
                    ("ソーナノ", 50),
                    ("ソーナノ", 10),
                    ("ソーナノ", 5),
                    ("ソーナノ", 10),
                    ("ソーナノ", 5),
                })),
                new EmGrass("アトリエのあな", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ドーブル", 40),
                    ("ドーブル", 41),
                    ("ドーブル", 42),
                    ("ドーブル", 43),
                    ("ドーブル", 44),
                    ("ドーブル", 45),
                    ("ドーブル", 46),
                    ("ドーブル", 47),
                    ("ドーブル", 48),
                    ("ドーブル", 49),
                    ("ドーブル", 50),
                    ("ドーブル", 50),
                })),
                new EmGrass("さばくのちかどう", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("メタモン", 38),
                    ("ゴニョニョ", 35),
                    ("メタモン", 40),
                    ("ドゴーム", 40),
                    ("メタモン", 41),
                    ("ゴニョニョ", 36),
                    ("ドゴーム", 38),
                    ("メタモン", 42),
                    ("ゴニョニョ", 38),
                    ("メタモン", 43),
                    ("ドゴーム", 44),
                    ("メタモン", 45),
                })),

                };
            }
        }

        public static class Surf
        {
            public static GBAMap[] SelectMap(string mapNameKeyWord = "")
                => tables.Where(_ => _.MapName.Contains(mapNameKeyWord)).ToArray();

            private static readonly GBAMap[] tables;
            static Surf()
            {
                tables = new GBAMap[]
                {
                new EmSurf("102ばんどうろ", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("マリル", 20, 11),
                    ("マリル", 10, 11),
                    ("マリル", 30, 6),
                    ("マリル", 5, 6),
                    ("トサキント", 20, 11),
                })),
                new EmSurf("103ばんどうろ", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("104ばんどうろ", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("105ばんすいどう", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("106ばんすいどう", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("107ばんすいどう", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("108ばんすいどう", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("109ばんすいどう", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("110ばんどうろ", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("111ばんどうろ", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("マリル", 20, 11),
                    ("マリル", 10, 11),
                    ("マリル", 30, 6),
                    ("マリル", 5, 6),
                    ("トサキント", 20, 11),
                })),
                new EmSurf("114ばんどうろ", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("マリル", 20, 11),
                    ("マリル", 10, 11),
                    ("マリル", 30, 6),
                    ("マリル", 5, 6),
                    ("トサキント", 20, 11),
                })),
                new EmSurf("115ばんどうろ", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("117ばんどうろ", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("マリル", 20, 11),
                    ("マリル", 10, 11),
                    ("マリル", 30, 6),
                    ("マリル", 5, 6),
                    ("トサキント", 20, 11),
                })),
                new EmSurf("118ばんどうろ", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("119ばんどうろ", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("120ばんどうろ", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("マリル", 20, 11),
                    ("マリル", 10, 11),
                    ("マリル", 30, 6),
                    ("マリル", 5, 6),
                    ("トサキント", 20, 11),
                })),
                new EmSurf("121ばんどうろ", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("122ばんすいどう", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("123ばんどうろ", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("124ばんすいどう", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("125ばんすいどう", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("126ばんすいどう", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("127ばんすいどう", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("128ばんすいどう", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("129ばんすいどう", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ホエルオー", 25, 6),
                })),
                new EmSurf("130ばんすいどう", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("131ばんすいどう", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("132ばんすいどう", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("133ばんすいどう", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("134ばんすいどう", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("トウカシティ", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("マリル", 20, 11),
                    ("マリル", 10, 11),
                    ("マリル", 30, 6),
                    ("マリル", 5, 6),
                    ("マリル", 5, 6),
                })),
                new EmSurf("ムロタウン", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("カイナシティ", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("ミナモシティ", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("トクサネシティ", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("ルネシティ", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 31),
                    ("コイキング", 10, 21),
                    ("コイキング", 15, 11),
                    ("コイキング", 25, 6),
                    ("コイキング", 25, 6),
                })),
                new EmSurf("キナギタウン", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("サイユウシティ", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("キャモメ", 10, 21),
                    ("キャモメ", 15, 11),
                    ("ペリッパー", 25, 6),
                    ("ペリッパー", 25, 6),
                })),
                new EmSurf("すてられぶね", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("メノクラゲ", 5, 31),
                    ("メノクラゲ", 5, 31),
                    ("メノクラゲ", 5, 31),
                    ("ドククラゲ", 30, 6),
                })),
                new EmSurf("りゅうせいのたき 入口", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ズバット", 5, 31),
                    ("ズバット", 30, 6),
                    ("ソルロック", 25, 11),
                    ("ソルロック", 15, 11),
                    ("ソルロック", 5, 11),
                })),
                new EmSurf("りゅうせいのたき 奥", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ゴルバット", 30, 6),
                    ("ゴルバット", 30, 6),
                    ("ソルロック", 25, 11),
                    ("ソルロック", 15, 11),
                    ("ソルロック", 5, 11),
                })),
                new EmSurf("あさせのほらあな", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("ズバット", 5, 31),
                    ("タマザラシ", 25, 6),
                    ("タマザラシ", 25, 6),
                    ("タマザラシ", 25, 11),
                })),
                new EmSurf("かいていどうくつ", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("ズバット", 5, 31),
                    ("ズバット", 30, 6),
                    ("ゴルバット", 30, 6),
                    ("ゴルバット", 30, 6),
                })),
                new EmSurf("チャンピオンロード", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ゴルバット", 30, 6),
                    ("ゴルバット", 25, 6),
                    ("ゴルバット", 35, 6),
                    ("ゴルバット", 35, 6),
                    ("ゴルバット", 35, 6),
                })),
                new EmSafariSurf("サファリゾーン 西エリア", 9, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コダック", 20, 11),
                    ("コダック", 20, 11),
                    ("コダック", 30, 6),
                    ("コダック", 30, 6),
                    ("コダック", 30, 6),
                })),
                new EmSafariSurf("サファリゾーン マッハエリア", 9, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コダック", 20, 11),
                    ("コダック", 20, 11),
                    ("コダック", 30, 6),
                    ("ゴルダック", 30, 6),
                    ("ゴルダック", 25, 16),
                })),
                new EmSafariSurf("サファリゾーン 追加エリア", 9, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ウパー", 25, 6),
                    ("マリル", 25, 6),
                    ("マリル", 25, 6),
                    ("マリル", 30, 6),
                    ("ヌオー", 35, 6),
                })),
                new EmSurf("すいちゅう", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("パールル", 20, 11),
                    ("チョンチー", 20, 11),
                    ("パールル", 30, 6),
                    ("ジーランス", 30, 6),
                    ("ジーランス", 30, 6),
                })),

                };
            }
        }

        public static class OldRod
        {
            public static GBAMap[] SelectMap(string mapNameKeyWord = "")
                => tables.Where(_ => _.MapName.Contains(mapNameKeyWord)).ToArray();

            private static readonly GBAMap[] tables;
            static OldRod()
            {
                tables = new GBAMap[]
                {
                new EmOldRod("102ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("トサキント", 5, 6),
                })),
                new EmOldRod("103ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("104ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("コイキング", 5, 6),
                })),
                new EmOldRod("105ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("106ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("107ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("108ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("109ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("110ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("111ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("トサキント", 5, 6),
                })),
                new EmOldRod("114ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("トサキント", 5, 6),
                })),
                new EmOldRod("115ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("117ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("トサキント", 5, 6),
                })),
                new EmOldRod("118ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmRoute119OldRod("119ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmFeebasSpotOldRod("119ばんどうろ(ヒンバススポット)", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("120ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("トサキント", 5, 6),
                })),
                new EmOldRod("121ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("122ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("123ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("124ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("125ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("126ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("127ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("128ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("129ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("130ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("131ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("132ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("133ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("134ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("トウカシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("トサキント", 5, 6),
                })),
                new EmOldRod("ムロタウン", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("カイナシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("ミナモシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("トクサネシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("ルネシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("コイキング", 10, 6),
                })),
                new EmOldRod("キナギタウン", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("サイユウシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("すてられぶね", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("りゅうせいのたき", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("トサキント", 5, 6),
                })),
                new EmOldRod("あさせのほらあな", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("かいていどうくつ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("メノクラゲ", 5, 6),
                })),
                new EmOldRod("チャンピオンロード", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("トサキント", 5, 6),
                })),
                new EmSafariOldRod("サファリゾーン", 35, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("トサキント", 5, 6),
                })),
                new EmSafariOldRod("サファリゾーン 追加エリア", 35, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 25, 6),
                    ("トサキント", 25, 6),
                })),

                };
            }
        }

        public static class GoodRod
        {
            public static GBAMap[] SelectMap(string mapNameKeyWord = "")
                => tables.Where(_ => _.MapName.Contains(mapNameKeyWord)).ToArray();

            private static readonly GBAMap[] tables;
            static GoodRod()
            {
                tables = new GBAMap[]
                {
                new EmGoodRod("102ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("トサキント", 10, 21),
                    ("ヘイガニ", 10, 21),
                })),
                new EmGoodRod("103ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("104ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("コイキング", 10, 21),
                    ("コイキング", 10, 21),
                })),
                new EmGoodRod("105ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("106ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("107ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("108ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("109ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("110ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("111ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("トサキント", 10, 21),
                    ("ドジョッチ", 10, 21),
                })),
                new EmGoodRod("114ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("トサキント", 10, 21),
                    ("ドジョッチ", 10, 21),
                })),
                new EmGoodRod("115ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("117ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("トサキント", 10, 21),
                    ("ヘイガニ", 10, 21),
                })),
                new EmGoodRod("118ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("キバニア", 10, 21),
                })),
                new EmRoute119GoodRod("119ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("キバニア", 10, 21),
                })),
                new EmFeebasSpotGoodRod("119ばんどうろ(ヒンバススポット)", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("キバニア", 10, 21),
                })),
                new EmGoodRod("120ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("トサキント", 10, 21),
                    ("ドジョッチ", 10, 21),
                })),
                new EmGoodRod("121ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("122ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("123ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("124ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("125ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("126ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("127ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("128ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("ラブカス", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("129ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("130ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("131ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("132ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("133ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("134ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("トウカシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("トサキント", 10, 21),
                    ("ヘイガニ", 10, 21),
                })),
                new EmGoodRod("ムロタウン", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("カイナシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("ミナモシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("トクサネシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("ルネシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("コイキング", 10, 21),
                    ("コイキング", 10, 21),
                })),
                new EmGoodRod("キナギタウン", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("サイユウシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("ラブカス", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("すてられぶね", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("メノクラゲ", 10, 21),
                })),
                new EmGoodRod("りゅうせいのたき", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("トサキント", 10, 21),
                    ("ドジョッチ", 10, 21),
                })),
                new EmGoodRod("あさせのほらあな", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("かいていどうくつ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("メノクラゲ", 10, 21),
                    ("ホエルコ", 10, 21),
                })),
                new EmGoodRod("チャンピオンロード", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("トサキント", 10, 21),
                    ("ドジョッチ", 10, 21),
                })),
                new EmSafariGoodRod("サファリゾーン", 35, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 10, 21),
                    ("トサキント", 10, 16),
                    ("トサキント", 10, 21),
                })),
                new EmSafariGoodRod("サファリゾーン 追加エリア", 35, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 25, 6),
                    ("トサキント", 25, 6),
                    ("テッポウオ", 30, 6),
                })),
                };
            }
        }

        public static class SuperRod
        {
            public static GBAMap[] SelectMap(string mapNameKeyWord = "")
                => tables.Where(_ => _.MapName.Contains(mapNameKeyWord)).ToArray();

            private static readonly GBAMap[] tables;
            static SuperRod()
            {
                tables = new GBAMap[]
                {
                new EmSuperRod("102ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ヘイガニ", 25, 6),
                    ("ヘイガニ", 30, 6),
                    ("ヘイガニ", 20, 6),
                    ("ヘイガニ", 35, 6),
                    ("ヘイガニ", 40, 6),
                })),
                new EmSuperRod("103ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("サメハダー", 30, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("104ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 25, 6),
                    ("コイキング", 30, 6),
                    ("コイキング", 20, 6),
                    ("コイキング", 35, 6),
                    ("コイキング", 40, 6),
                })),
                new EmSuperRod("105ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 20, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("106ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 20, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("107ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 20, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("108ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 20, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("109ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 20, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("110ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 20, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("111ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ドジョッチ", 25, 6),
                    ("ドジョッチ", 30, 6),
                    ("ドジョッチ", 20, 6),
                    ("ドジョッチ", 35, 6),
                    ("ドジョッチ", 40, 6),
                })),
                new EmSuperRod("114ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ドジョッチ", 25, 6),
                    ("ドジョッチ", 30, 6),
                    ("ドジョッチ", 20, 6),
                    ("ドジョッチ", 35, 6),
                    ("ドジョッチ", 40, 6),
                })),
                new EmSuperRod("115ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 20, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("117ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ヘイガニ", 25, 6),
                    ("ヘイガニ", 30, 6),
                    ("ヘイガニ", 20, 6),
                    ("ヘイガニ", 35, 6),
                    ("ヘイガニ", 40, 6),
                })),
                new EmSuperRod("118ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("サメハダー", 30, 6),
                    ("キバニア", 30, 6),
                    ("キバニア", 20, 6),
                    ("キバニア", 35, 6),
                    ("キバニア", 40, 6),
                })),
                new EmRoute119SuperRod("119ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("キバニア", 25, 6),
                    ("キバニア", 30, 6),
                    ("キバニア", 20, 6),
                    ("キバニア", 35, 6),
                    ("キバニア", 40, 6),
                })),
                new EmFeebasSpotSuperRod("119ばんどうろ(ヒンバススポット)", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("キバニア", 25, 6),
                    ("キバニア", 30, 6),
                    ("キバニア", 20, 6),
                    ("キバニア", 35, 6),
                    ("キバニア", 40, 6),
                })),
                new EmSuperRod("120ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ドジョッチ", 25, 6),
                    ("ドジョッチ", 30, 6),
                    ("ドジョッチ", 20, 6),
                    ("ドジョッチ", 35, 6),
                    ("ドジョッチ", 40, 6),
                })),
                new EmSuperRod("121ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 20, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("122ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("サメハダー", 30, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("123ばんどうろ", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 20, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("124ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("サメハダー", 30, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("125ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("サメハダー", 30, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("126ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("サメハダー", 30, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("127ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("サメハダー", 30, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("128ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ラブカス", 30, 6),
                    ("ホエルコ", 30, 6),
                    ("サニーゴ", 30, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("129ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("サメハダー", 30, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("130ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("サメハダー", 30, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("131ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("サメハダー", 30, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("132ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("サメハダー", 30, 6),
                    ("ホエルコ", 30, 6),
                    ("タッツー", 25, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("133ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("サメハダー", 30, 6),
                    ("ホエルコ", 30, 6),
                    ("タッツー", 25, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("134ばんすいどう", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("サメハダー", 30, 6),
                    ("ホエルコ", 30, 6),
                    ("タッツー", 25, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("トウカシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ヘイガニ", 25, 6),
                    ("ヘイガニ", 30, 6),
                    ("ヘイガニ", 20, 6),
                    ("ヘイガニ", 35, 6),
                    ("ヘイガニ", 40, 6),
                })),
                new EmSuperRod("ムロタウン", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 20, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("カイナシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 20, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("ミナモシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 30, 6),
                    ("ヒトデマン", 25, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("トクサネシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("サメハダー", 30, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("ルネシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 30, 6),
                    ("コイキング", 30, 6),
                    ("ギャラドス", 35, 6),
                    ("ギャラドス", 35, 11),
                    ("ギャラドス", 5, 41),
                })),
                new EmSuperRod("キナギタウン", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("サメハダー", 30, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("サイユウシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ラブカス", 30, 6),
                    ("ホエルコ", 30, 6),
                    ("サニーゴ", 30, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("すてられぶね", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 25, 6),
                    ("メノクラゲ", 30, 6),
                    ("ドククラゲ", 30, 6),
                    ("ドククラゲ", 25, 6),
                    ("ドククラゲ", 20, 6),
                })),
                new EmSuperRod("りゅうせいのたき 入口", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ドジョッチ", 25, 6),
                    ("ドジョッチ", 30, 6),
                    ("ドジョッチ", 20, 6),
                    ("ドジョッチ", 35, 6),
                    ("ドジョッチ", 40, 6),
                })),
                new EmSuperRod("りゅうせいのたき 奥", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ドジョッチ", 25, 6),
                    ("ドジョッチ", 30, 6),
                    ("ナマズン", 30, 6),
                    ("ナマズン", 35, 6),
                    ("ナマズン", 40, 6),
                })),
                new EmSuperRod("あさせのほらあな", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 20, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("かいていどうくつ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ホエルコ", 25, 6),
                    ("ホエルコ", 30, 6),
                    ("ホエルコ", 20, 6),
                    ("ホエルコ", 35, 6),
                    ("ホエルコ", 40, 6),
                })),
                new EmSuperRod("チャンピオンロード", 30, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ドジョッチ", 25, 6),
                    ("ドジョッチ", 30, 6),
                    ("ナマズン", 30, 6),
                    ("ナマズン", 35, 6),
                    ("ナマズン", 40, 6),
                })),
                new EmSafariSuperRod("サファリゾーン", 35, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("トサキント", 25, 6),
                    ("トサキント", 30, 6),
                    ("アズマオウ", 30, 6),
                    ("アズマオウ", 35, 6),
                    ("アズマオウ", 25, 6),
                })),
                new EmSafariSuperRod("サファリゾーン 追加エリア", 35, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("トサキント", 25, 6),
                    ("テッポウオ", 25, 6),
                    ("テッポウオ", 30, 6),
                    ("テッポウオ", 30, 6),
                    ("オクタン", 35, 6),
                })),

                };
            }
        }

        public static class RockSmash
        {
            public static GBAMap[] SelectMap(string mapNameKeyWord = "")
                => tables.Where(_ => _.MapName.Contains(mapNameKeyWord)).ToArray();

            private static readonly GBAMap[] tables;
            static RockSmash()
            {
                tables = new GBAMap[]
                {
                new EmRockSmash("111ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 10, 6),
                    ("イシツブテ", 5, 6),
                    ("イシツブテ", 15, 6),
                    ("イシツブテ", 15, 6),
                    ("イシツブテ", 15, 6),
                })),
                new EmRockSmash("114ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 10, 6),
                    ("イシツブテ", 5, 6),
                    ("イシツブテ", 15, 6),
                    ("イシツブテ", 15, 6),
                    ("イシツブテ", 15, 6),
                })),
                new EmRockSmash("いしのどうくつ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 10, 6),
                    ("ノズパス", 10, 11),
                    ("イシツブテ", 5, 6),
                    ("イシツブテ", 15, 6),
                    ("イシツブテ", 15, 6),
                })),
                new EmRockSmash("チャンピオンロード", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ゴローン", 30, 11),
                    ("イシツブテ", 30, 11),
                    ("ゴローン", 35, 6),
                    ("ゴローン", 35, 6),
                    ("ゴローン", 35, 6),
                })),
                new EmSafariRockSmash("サファリゾーン ダートエリア", 25, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 10, 6),
                    ("イシツブテ", 5, 6),
                    ("イシツブテ", 15, 6),
                    ("イシツブテ", 20, 6),
                    ("イシツブテ", 25, 6),
                })),
                new EmSafariRockSmash("サファリゾーン 追加エリア", 25, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ツボツボ", 25, 6),
                    ("ツボツボ", 20, 6),
                    ("ツボツボ", 30, 6),
                    ("ツボツボ", 30, 6),
                    ("ツボツボ", 35, 6),
                })),
                };
            }
        }

    }

}
