using System.Linq;
using System.Collections.Generic;
using System.Text;

namespace Pokemon3genRNGLibrary.MapData
{
    public static class FRMapData
    {
        public static class Field
        {
            public static GBAMap[] SelectMap(string mapNameKeyWord = "")
                => tables.Where(_ => _.MapName.Contains(mapNameKeyWord)).ToArray();


            private static readonly GBAMap[] tables;
            static Field()
            {
                tables = new GBAMap[]
                {
                new FRLGGrass("1ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ポッポ", 3),
                    ("コラッタ", 3),
                    ("ポッポ", 3),
                    ("コラッタ", 3),
                    ("ポッポ", 2),
                    ("コラッタ", 2),
                    ("ポッポ", 3),
                    ("コラッタ", 3),
                    ("ポッポ", 4),
                    ("コラッタ", 4),
                    ("ポッポ", 5),
                    ("コラッタ", 4),
                })),
                new FRLGGrass("2ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("コラッタ", 3),
                    ("ポッポ", 3),
                    ("コラッタ", 4),
                    ("ポッポ", 4),
                    ("コラッタ", 2),
                    ("ポッポ", 2),
                    ("コラッタ", 5),
                    ("ポッポ", 5),
                    ("キャタピー", 4),
                    ("ビードル", 4),
                    ("キャタピー", 5),
                    ("ビードル", 5),
                })),
                new FRLGGrass("3ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("オニスズメ", 6),
                    ("ポッポ", 6),
                    ("オニスズメ", 7),
                    ("マンキー", 7),
                    ("ニドラン♂", 6),
                    ("ポッポ", 7),
                    ("オニスズメ", 8),
                    ("プリン", 3),
                    ("ニドラン♂", 7),
                    ("プリン", 5),
                    ("ニドラン♀", 6),
                    ("プリン", 7),
                })),
                new FRLGGrass("4ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("オニスズメ", 10),
                    ("コラッタ", 10),
                    ("アーボ", 6),
                    ("アーボ", 10),
                    ("オニスズメ", 8),
                    ("コラッタ", 8),
                    ("オニスズメ", 12),
                    ("コラッタ", 12),
                    ("マンキー", 10),
                    ("アーボ", 8),
                    ("マンキー", 12),
                    ("アーボ", 12),
                })),
                new FRLGGrass("5ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ニャース", 10),
                    ("ポッポ", 13),
                    ("ナゾノクサ", 13),
                    ("ニャース", 12),
                    ("ナゾノクサ", 15),
                    ("ポッポ", 15),
                    ("ナゾノクサ", 16),
                    ("ポッポ", 16),
                    ("ポッポ", 15),
                    ("ニャース", 14),
                    ("ポッポ", 15),
                    ("ニャース", 16),
                })),
                new FRLGGrass("6ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ニャース", 10),
                    ("ポッポ", 13),
                    ("ナゾノクサ", 13),
                    ("ニャース", 12),
                    ("ナゾノクサ", 15),
                    ("ポッポ", 15),
                    ("ナゾノクサ", 16),
                    ("ポッポ", 16),
                    ("ポッポ", 15),
                    ("ニャース", 14),
                    ("ポッポ", 15),
                    ("ニャース", 16),
                })),
                new FRLGGrass("7ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ポッポ", 19),
                    ("ニャース", 17),
                    ("ナゾノクサ", 19),
                    ("ニャース", 18),
                    ("ポッポ", 22),
                    ("ナゾノクサ", 22),
                    ("ガーディ", 18),
                    ("ガーディ", 20),
                    ("ニャース", 17),
                    ("ニャース", 19),
                    ("ニャース", 17),
                    ("ニャース", 20),
                })),
                new FRLGGrass("8ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ポッポ", 18),
                    ("ニャース", 18),
                    ("ガーディ", 16),
                    ("ポッポ", 20),
                    ("ニャース", 20),
                    ("アーボ", 17),
                    ("ガーディ", 17),
                    ("アーボ", 19),
                    ("アーボ", 17),
                    ("ガーディ", 15),
                    ("アーボ", 17),
                    ("ガーディ", 18),
                })),
                new FRLGGrass("9ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("オニスズメ", 16),
                    ("コラッタ", 16),
                    ("アーボ", 11),
                    ("アーボ", 15),
                    ("オニスズメ", 13),
                    ("コラッタ", 14),
                    ("オニスズメ", 17),
                    ("コラッタ", 17),
                    ("コラッタ", 14),
                    ("アーボ", 13),
                    ("コラッタ", 14),
                    ("アーボ", 17),
                })),
                new FRLGGrass("10ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("オニスズメ", 16),
                    ("ビリリダマ", 16),
                    ("アーボ", 11),
                    ("アーボ", 15),
                    ("オニスズメ", 13),
                    ("ビリリダマ", 14),
                    ("オニスズメ", 17),
                    ("ビリリダマ", 17),
                    ("ビリリダマ", 14),
                    ("アーボ", 13),
                    ("ビリリダマ", 14),
                    ("アーボ", 17),
                })),
                new FRLGGrass("11ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("アーボ", 14),
                    ("オニスズメ", 15),
                    ("アーボ", 12),
                    ("オニスズメ", 13),
                    ("スリープ", 11),
                    ("スリープ", 13),
                    ("アーボ", 15),
                    ("オニスズメ", 17),
                    ("アーボ", 12),
                    ("スリープ", 15),
                    ("アーボ", 12),
                    ("スリープ", 15),
                })),
                new FRLGGrass("12ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ナゾノクサ", 24),
                    ("コンパン", 24),
                    ("ナゾノクサ", 22),
                    ("ポッポ", 23),
                    ("ポッポ", 25),
                    ("コンパン", 26),
                    ("ナゾノクサ", 26),
                    ("ポッポ", 27),
                    ("ポッポ", 23),
                    ("クサイハナ", 28),
                    ("ポッポ", 23),
                    ("クサイハナ", 30),
                })),
                new FRLGGrass("13ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ナゾノクサ", 24),
                    ("コンパン", 24),
                    ("ナゾノクサ", 22),
                    ("ポッポ", 27),
                    ("ポッポ", 25),
                    ("コンパン", 26),
                    ("ナゾノクサ", 26),
                    ("メタモン", 25),
                    ("ピジョン", 29),
                    ("クサイハナ", 28),
                    ("ピジョン", 29),
                    ("クサイハナ", 30),
                })),
                new FRLGGrass("14ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ナゾノクサ", 24),
                    ("コンパン", 24),
                    ("ナゾノクサ", 22),
                    ("メタモン", 23),
                    ("ポッポ", 27),
                    ("コンパン", 26),
                    ("ナゾノクサ", 26),
                    ("クサイハナ", 30),
                    ("メタモン", 23),
                    ("ピジョン", 29),
                    ("メタモン", 23),
                    ("ピジョン", 29),
                })),
                new FRLGGrass("15ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ナゾノクサ", 24),
                    ("コンパン", 24),
                    ("ナゾノクサ", 22),
                    ("ポッポ", 27),
                    ("ポッポ", 25),
                    ("コンパン", 26),
                    ("ナゾノクサ", 26),
                    ("メタモン", 25),
                    ("ピジョン", 29),
                    ("クサイハナ", 28),
                    ("ピジョン", 29),
                    ("クサイハナ", 30),
                })),
                new FRLGGrass("16ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("オニスズメ", 20),
                    ("ドードー", 18),
                    ("コラッタ", 18),
                    ("コラッタ", 20),
                    ("オニスズメ", 22),
                    ("ドードー", 20),
                    ("コラッタ", 22),
                    ("ドードー", 22),
                    ("コラッタ", 18),
                    ("ラッタ", 23),
                    ("コラッタ", 18),
                    ("ラッタ", 25),
                })),
                new FRLGGrass("17ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("オニスズメ", 20),
                    ("ドードー", 24),
                    ("オニスズメ", 22),
                    ("ドードー", 26),
                    ("ラッタ", 25),
                    ("ラッタ", 27),
                    ("ドードー", 28),
                    ("ラッタ", 29),
                    ("コラッタ", 22),
                    ("オニドリル", 25),
                    ("コラッタ", 22),
                    ("オニドリル", 27),
                })),
                new FRLGGrass("18ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("オニスズメ", 20),
                    ("ドードー", 24),
                    ("オニスズメ", 22),
                    ("ドードー", 26),
                    ("ラッタ", 25),
                    ("オニドリル", 25),
                    ("ドードー", 28),
                    ("ラッタ", 29),
                    ("コラッタ", 22),
                    ("オニドリル", 27),
                    ("コラッタ", 22),
                    ("オニドリル", 29),
                })),
                new FRLGGrass("21ばんすいどう", 15, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("モンジャラ", 22),
                    ("モンジャラ", 23),
                    ("モンジャラ", 24),
                    ("モンジャラ", 21),
                    ("モンジャラ", 25),
                    ("モンジャラ", 20),
                    ("モンジャラ", 19),
                    ("モンジャラ", 26),
                    ("モンジャラ", 18),
                    ("モンジャラ", 27),
                    ("モンジャラ", 17),
                    ("モンジャラ", 28),
                })),
                new FRLGGrass("22ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("コラッタ", 3),
                    ("マンキー", 3),
                    ("コラッタ", 4),
                    ("マンキー", 4),
                    ("コラッタ", 2),
                    ("マンキー", 2),
                    ("オニスズメ", 3),
                    ("オニスズメ", 5),
                    ("コラッタ", 5),
                    ("マンキー", 5),
                    ("コラッタ", 5),
                    ("マンキー", 5),
                })),
                new FRLGGrass("23ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("マンキー", 32),
                    ("オニドリル", 40),
                    ("マンキー", 34),
                    ("オニスズメ", 34),
                    ("アーボ", 32),
                    ("アーボ", 34),
                    ("オコリザル", 42),
                    ("アーボック", 44),
                    ("オニスズメ", 32),
                    ("オニドリル", 42),
                    ("オニスズメ", 32),
                    ("オニドリル", 44),
                })),
                new FRLGGrass("24ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ビードル", 7),
                    ("キャタピー", 7),
                    ("ポッポ", 11),
                    ("ナゾノクサ", 12),
                    ("ナゾノクサ", 13),
                    ("ケーシィ", 10),
                    ("ポッポ", 13),
                    ("ナゾノクサ", 14),
                    ("コクーン", 8),
                    ("ケーシィ", 8),
                    ("トランセル", 8),
                    ("ケーシィ", 12),
                })),
                new FRLGGrass("25ばんどうろ", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ビードル", 8),
                    ("キャタピー", 8),
                    ("ポッポ", 13),
                    ("ナゾノクサ", 14),
                    ("ナゾノクサ", 13),
                    ("ケーシィ", 11),
                    ("ポッポ", 11),
                    ("ナゾノクサ", 12),
                    ("コクーン", 9),
                    ("ケーシィ", 9),
                    ("トランセル", 9),
                    ("ケーシィ", 13),
                })),
                new FRLGGrass("3のしま みなと", 1, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ノコッチ", 15),
                    ("ノコッチ", 15),
                    ("ノコッチ", 10),
                    ("ノコッチ", 10),
                    ("ノコッチ", 20),
                    ("ノコッチ", 20),
                    ("ノコッチ", 25),
                    ("ノコッチ", 30),
                    ("ノコッチ", 25),
                    ("ノコッチ", 30),
                    ("ノコッチ", 5),
                    ("ノコッチ", 35),
                })),
                new FRLGGrass("5のしま あきち", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ポッポ", 44),
                    ("オタチ", 10),
                    ("ピジョン", 48),
                    ("ハネッコ", 10),
                    ("オタチ", 15),
                    ("ニャース", 41),
                    ("ハネッコ", 15),
                    ("コダック", 41),
                    ("ピジョン", 50),
                    ("ペルシアン", 47),
                    ("ピジョン", 50),
                    ("ペルシアン", 50),
                })),
                new FRLGGrass("トキワのもり", 15, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("キャタピー", 4),
                    ("ビードル", 4),
                    ("キャタピー", 5),
                    ("ビードル", 5),
                    ("キャタピー", 3),
                    ("ビードル", 3),
                    ("トランセル", 5),
                    ("コクーン", 5),
                    ("コクーン", 4),
                    ("ピカチュウ", 3),
                    ("コクーン", 6),
                    ("ピカチュウ", 5),
                })),
                new FRLGGrass("おつきみやま 1F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ズバット", 7),
                    ("ズバット", 8),
                    ("イシツブテ", 7),
                    ("ズバット", 9),
                    ("ズバット", 10),
                    ("イシツブテ", 8),
                    ("イシツブテ", 9),
                    ("パラス", 8),
                    ("ズバット", 7),
                    ("ズバット", 7),
                    ("ズバット", 7),
                    ("ピッピ", 8),
                })),
                new FRLGGrass("おつきみやま B1F", 5, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("パラス", 7),
                    ("パラス", 8),
                    ("パラス", 5),
                    ("パラス", 6),
                    ("パラス", 9),
                    ("パラス", 10),
                    ("パラス", 7),
                    ("パラス", 8),
                    ("パラス", 5),
                    ("パラス", 6),
                    ("パラス", 9),
                    ("パラス", 10),
                })),
                new FRLGGrass("おつきみやま B2F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ズバット", 8),
                    ("イシツブテ", 9),
                    ("ズバット", 9),
                    ("ズバット", 10),
                    ("イシツブテ", 10),
                    ("パラス", 10),
                    ("パラス", 12),
                    ("ピッピ", 10),
                    ("ズバット", 11),
                    ("ズバット", 11),
                    ("ズバット", 11),
                    ("ピッピ", 12),
                })),
                new FRLGGrass("ディグダのあな", 5, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ディグダ", 18),
                    ("ディグダ", 19),
                    ("ディグダ", 17),
                    ("ディグダ", 15),
                    ("ディグダ", 16),
                    ("ディグダ", 20),
                    ("ディグダ", 21),
                    ("ディグダ", 22),
                    ("ディグダ", 17),
                    ("ダグトリオ", 29),
                    ("ディグダ", 17),
                    ("ダグトリオ", 31),
                })),
                new FRLGGrass("むじんはつでんしょ", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ビリリダマ", 22),
                    ("コイル", 22),
                    ("ビリリダマ", 25),
                    ("コイル", 25),
                    ("ピカチュウ", 22),
                    ("ピカチュウ", 24),
                    ("レアコイル", 31),
                    ("レアコイル", 34),
                    ("ピカチュウ", 26),
                    ("エレブー", 32),
                    ("ピカチュウ", 26),
                    ("エレブー", 35),
                })),
                new FRLGGrass("イワヤマトンネル 1F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ズバット", 15),
                    ("イシツブテ", 16),
                    ("マンキー", 16),
                    ("イシツブテ", 17),
                    ("ズバット", 16),
                    ("ワンリキー", 16),
                    ("マンキー", 17),
                    ("ワンリキー", 17),
                    ("イシツブテ", 15),
                    ("イワーク", 13),
                    ("イシツブテ", 15),
                    ("イワーク", 15),
                })),
                new FRLGGrass("イワヤマトンネル B1F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ズバット", 16),
                    ("イシツブテ", 17),
                    ("マンキー", 17),
                    ("イシツブテ", 16),
                    ("ズバット", 15),
                    ("ワンリキー", 17),
                    ("マンキー", 16),
                    ("イワーク", 13),
                    ("イシツブテ", 15),
                    ("イワーク", 15),
                    ("イシツブテ", 15),
                    ("イワーク", 17),
                })),
                new FRLGGrass("ポケモンタワー 3F", 2, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴース", 15),
                    ("ゴース", 16),
                    ("ゴース", 17),
                    ("ゴース", 13),
                    ("ゴース", 14),
                    ("ゴース", 18),
                    ("ゴース", 19),
                    ("カラカラ", 15),
                    ("ゴース", 17),
                    ("カラカラ", 17),
                    ("ゴース", 17),
                    ("ゴースト", 20),
                })),
                new FRLGGrass("ポケモンタワー 4F", 4, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴース", 15),
                    ("ゴース", 16),
                    ("ゴース", 17),
                    ("ゴース", 13),
                    ("ゴース", 14),
                    ("ゴース", 18),
                    ("ゴースト", 20),
                    ("カラカラ", 15),
                    ("ゴース", 17),
                    ("カラカラ", 17),
                    ("ゴース", 17),
                    ("ゴース", 19),
                })),
                new FRLGGrass("ポケモンタワー 5F", 6, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴース", 15),
                    ("ゴース", 16),
                    ("ゴース", 17),
                    ("ゴース", 13),
                    ("ゴース", 14),
                    ("ゴース", 18),
                    ("ゴースト", 20),
                    ("カラカラ", 15),
                    ("ゴース", 17),
                    ("カラカラ", 17),
                    ("ゴース", 17),
                    ("ゴース", 19),
                })),
                new FRLGGrass("ポケモンタワー 6F", 8, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴース", 16),
                    ("ゴース", 17),
                    ("ゴース", 18),
                    ("ゴース", 14),
                    ("ゴース", 15),
                    ("ゴース", 19),
                    ("ゴースト", 21),
                    ("カラカラ", 17),
                    ("ゴース", 18),
                    ("カラカラ", 19),
                    ("ゴース", 18),
                    ("ゴースト", 23),
                })),
                new FRLGGrass("ポケモンタワー 7F", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴース", 16),
                    ("ゴース", 17),
                    ("ゴース", 18),
                    ("ゴース", 15),
                    ("ゴース", 19),
                    ("ゴースト", 23),
                    ("カラカラ", 17),
                    ("カラカラ", 19),
                    ("ゴース", 18),
                    ("ゴースト", 23),
                    ("ゴース", 18),
                    ("ゴースト", 25),
                })),
                new FRLGGrass("ふたごじま 1F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("コダック", 27),
                    ("コダック", 29),
                    ("コダック", 31),
                    ("ズバット", 22),
                    ("ズバット", 22),
                    ("ズバット", 24),
                    ("ゴルバット", 26),
                    ("ゴルバット", 28),
                    ("コダック", 33),
                    ("ズバット", 26),
                    ("コダック", 26),
                    ("ゴルバット", 30),
                })),
                new FRLGGrass("ふたごじま B1F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("コダック", 29),
                    ("コダック", 31),
                    ("パウワウ", 28),
                    ("ズバット", 22),
                    ("ズバット", 22),
                    ("ズバット", 24),
                    ("ゴルバット", 26),
                    ("ゴルバット", 28),
                    ("ゴルダック", 33),
                    ("ズバット", 26),
                    ("ゴルダック", 35),
                    ("ゴルバット", 30),
                })),
                new FRLGGrass("ふたごじま B2F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("コダック", 30),
                    ("コダック", 32),
                    ("パウワウ", 30),
                    ("パウワウ", 32),
                    ("ズバット", 22),
                    ("ズバット", 24),
                    ("ゴルバット", 26),
                    ("ゴルダック", 34),
                    ("ゴルダック", 32),
                    ("ゴルバット", 28),
                    ("ゴルダック", 32),
                    ("ゴルバット", 30),
                })),
                new FRLGGrass("ふたごじま B3F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("パウワウ", 30),
                    ("パウワウ", 32),
                    ("コダック", 32),
                    ("コダック", 30),
                    ("ゴルダック", 32),
                    ("ズバット", 24),
                    ("ゴルバット", 26),
                    ("ゴルダック", 34),
                    ("ジュゴン", 32),
                    ("ゴルバット", 28),
                    ("ジュゴン", 34),
                    ("ゴルバット", 30),
                })),
                new FRLGGrass("ふたごじま B4F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("パウワウ", 30),
                    ("パウワウ", 32),
                    ("コダック", 32),
                    ("パウワウ", 34),
                    ("ゴルダック", 32),
                    ("ゴルバット", 26),
                    ("ジュゴン", 34),
                    ("ゴルダック", 34),
                    ("ジュゴン", 36),
                    ("ゴルバット", 28),
                    ("ジュゴン", 36),
                    ("ゴルバット", 30),
                })),
                new FRLGGrass("ポケモンやしき 1F-3F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ドガース", 28),
                    ("ラッタ", 32),
                    ("ドガース", 30),
                    ("ラッタ", 36),
                    ("ガーディ", 30),
                    ("コラッタ", 28),
                    ("ベトベター", 28),
                    ("マタドガス", 32),
                    ("ガーディ", 32),
                    ("コラッタ", 26),
                    ("ガーディ", 32),
                    ("コラッタ", 26),
                })),
                new FRLGGrass("ポケモンやしき B1F", 5, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ドガース", 28),
                    ("ラッタ", 34),
                    ("ドガース", 30),
                    ("メタモン", 30),
                    ("ガーディ", 30),
                    ("ラッタ", 38),
                    ("ベトベター", 28),
                    ("マタドガス", 34),
                    ("ガーディ", 32),
                    ("コラッタ", 26),
                    ("ガーディ", 32),
                    ("コラッタ", 26),
                })),
                new FRLGGrass("チャンピオンロード 1F/3F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ワンリキー", 32),
                    ("イシツブテ", 32),
                    ("イワーク", 40),
                    ("イワーク", 43),
                    ("イワーク", 46),
                    ("ズバット", 32),
                    ("アーボック", 44),
                    ("ゴルバット", 44),
                    ("ガラガラ", 44),
                    ("ゴーリキー", 44),
                    ("ゴーリキー", 46),
                    ("ガラガラ", 46),
                })),
                new FRLGGrass("チャンピオンロード 2F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ワンリキー", 34),
                    ("イシツブテ", 34),
                    ("オコリザル", 42),
                    ("イワーク", 45),
                    ("イワーク", 48),
                    ("ズバット", 34),
                    ("アーボック", 46),
                    ("ゴルバット", 46),
                    ("ガラガラ", 46),
                    ("ゴーリキー", 46),
                    ("ゴーリキー", 48),
                    ("ガラガラ", 48),
                })),
                new FRLGGrass("ハナダのどうくつ 1F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("レアコイル", 49),
                    ("パラセクト", 49),
                    ("ゴルバット", 46),
                    ("ゴーリキー", 46),
                    ("オコリザル", 52),
                    ("メタモン", 52),
                    ("マルマイン", 58),
                    ("パラセクト", 58),
                    ("ゴルバット", 55),
                    ("ソーナンス", 55),
                    ("オコリザル", 61),
                    ("メタモン", 61),
                })),
                new FRLGGrass("ハナダのどうくつ 2F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴルバット", 49),
                    ("ゴーリキー", 49),
                    ("レアコイル", 52),
                    ("パラセクト", 52),
                    ("ユンゲラー", 55),
                    ("メタモン", 55),
                    ("ゴルバット", 58),
                    ("ソーナンス", 58),
                    ("マルマイン", 61),
                    ("パラセクト", 61),
                    ("ユンゲラー", 64),
                    ("メタモン", 64),
                })),
                new FRLGGrass("ハナダのどうくつ B1F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ユンゲラー", 58),
                    ("メタモン", 58),
                    ("レアコイル", 55),
                    ("パラセクト", 55),
                    ("ゴルバット", 52),
                    ("ゴーリキー", 52),
                    ("ユンゲラー", 67),
                    ("メタモン", 67),
                    ("マルマイン", 64),
                    ("パラセクト", 64),
                    ("ゴルバット", 61),
                    ("ソーナンス", 61),
                })),
                new FRLGGrass("サファリゾーン 中央エリア", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("サイホーン", 25),
                    ("ニドラン♂", 22),
                    ("タマタマ", 24),
                    ("タマタマ", 25),
                    ("コンパン", 22),
                    ("ニドリーノ", 31),
                    ("ニドリーナ", 31),
                    ("パラセクト", 30),
                    ("コンパン", 22),
                    ("ストライク", 23),
                    ("コンパン", 22),
                    ("ラッキー", 23),
                })),
                new FRLGGrass("サファリゾーン 東エリア", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ニドラン♂", 24),
                    ("ドードー", 26),
                    ("タマタマ", 23),
                    ("タマタマ", 25),
                    ("パラス", 22),
                    ("ニドリーノ", 33),
                    ("ニドラン♀", 24),
                    ("パラセクト", 25),
                    ("パラス", 22),
                    ("ガルーラ", 25),
                    ("パラス", 22),
                    ("ストライク", 28),
                })),
                new FRLGGrass("サファリゾーン 北エリア", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("サイホーン", 26),
                    ("ニドラン♂", 30),
                    ("タマタマ", 25),
                    ("タマタマ", 27),
                    ("パラス", 23),
                    ("ニドリーノ", 30),
                    ("ニドリーナ", 30),
                    ("モルフォン", 32),
                    ("パラス", 23),
                    ("ラッキー", 26),
                    ("パラス", 23),
                    ("ケンタロス", 28),
                })),
                new FRLGGrass("サファリゾーン 西エリア", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ドードー", 26),
                    ("ニドラン♂", 22),
                    ("タマタマ", 25),
                    ("タマタマ", 27),
                    ("コンパン", 23),
                    ("ニドリーノ", 30),
                    ("ニドラン♀", 30),
                    ("モルフォン", 32),
                    ("コンパン", 23),
                    ("ケンタロス", 25),
                    ("コンパン", 23),
                    ("ガルーラ", 28),
                })),
                new FRLGGrass("たからのはま", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("オニスズメ", 32),
                    ("モンジャラ", 33),
                    ("オニスズメ", 31),
                    ("モンジャラ", 35),
                    ("オニドリル", 36),
                    ("ニャース", 31),
                    ("オニドリル", 38),
                    ("コダック", 31),
                    ("オニドリル", 40),
                    ("ペルシアン", 37),
                    ("オニドリル", 40),
                    ("ペルシアン", 40),
                })),
                new FRLGGrass("ほてりのみち", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("オニスズメ", 32),
                    ("ポニータ", 34),
                    ("オニドリル", 36),
                    ("ポニータ", 31),
                    ("イシツブテ", 31),
                    ("ニャース", 31),
                    ("オニスズメ", 30),
                    ("コダック", 34),
                    ("ギャロップ", 37),
                    ("ペルシアン", 37),
                    ("ギャロップ", 40),
                    ("ペルシアン", 40),
                })),
                new FRLGGrass("ともしびやま 外", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ポニータ", 30),
                    ("オニドリル", 38),
                    ("ポニータ", 33),
                    ("オニスズメ", 32),
                    ("ワンリキー", 35),
                    ("イシツブテ", 33),
                    ("ポニータ", 36),
                    ("オニドリル", 40),
                    ("オニスズメ", 30),
                    ("ギャロップ", 39),
                    ("オニスズメ", 30),
                    ("ギャロップ", 42),
                })),
                new FRLGGrass("ともしびやま 洞窟(左)", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("イシツブテ", 33),
                    ("ワンリキー", 35),
                    ("イシツブテ", 29),
                    ("イシツブテ", 31),
                    ("ワンリキー", 31),
                    ("ワンリキー", 33),
                    ("イシツブテ", 35),
                    ("ワンリキー", 37),
                    ("イシツブテ", 37),
                    ("ワンリキー", 39),
                    ("イシツブテ", 37),
                    ("ワンリキー", 39),
                })),
                new FRLGGrass("ともしびやま 洞窟(左) 火口", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("イシツブテ", 34),
                    ("ワンリキー", 36),
                    ("イシツブテ", 30),
                    ("イシツブテ", 32),
                    ("ワンリキー", 32),
                    ("ワンリキー", 34),
                    ("ゴーリキー", 38),
                    ("ゴーリキー", 38),
                    ("ゴーリキー", 40),
                    ("ゴーリキー", 40),
                    ("ゴーリキー", 40),
                    ("ゴーリキー", 40),
                })),
                new FRLGGrass("ともしびやま 洞窟(右) 1F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("イシツブテ", 36),
                    ("ワンリキー", 38),
                    ("イシツブテ", 32),
                    ("イシツブテ", 34),
                    ("ワンリキー", 34),
                    ("ワンリキー", 36),
                    ("イシツブテ", 38),
                    ("ゴーリキー", 40),
                    ("イシツブテ", 40),
                    ("ゴーリキー", 42),
                    ("イシツブテ", 40),
                    ("ゴーリキー", 42),
                })),
                new FRLGGrass("ともしびやま 洞窟(右) B1F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("イシツブテ", 38),
                    ("イシツブテ", 36),
                    ("イシツブテ", 34),
                    ("イシツブテ", 40),
                    ("マグマッグ", 24),
                    ("マグマッグ", 26),
                    ("イシツブテ", 42),
                    ("マグマッグ", 28),
                    ("イシツブテ", 42),
                    ("マグマッグ", 30),
                    ("イシツブテ", 42),
                    ("マグマッグ", 30),
                })),
                new FRLGGrass("ともしびやま 洞窟(右) B2F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("イシツブテ", 40),
                    ("マグマッグ", 26),
                    ("イシツブテ", 42),
                    ("マグマッグ", 24),
                    ("マグマッグ", 28),
                    ("マグマッグ", 30),
                    ("イシツブテ", 44),
                    ("マグマッグ", 32),
                    ("イシツブテ", 44),
                    ("マグマッグ", 22),
                    ("イシツブテ", 44),
                    ("マグマッグ", 22),
                })),
                new FRLGGrass("ともしびやま 洞窟(右) B3F", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("マグマッグ", 26),
                    ("マグマッグ", 28),
                    ("マグマッグ", 30),
                    ("マグマッグ", 32),
                    ("マグマッグ", 24),
                    ("マグマッグ", 22),
                    ("マグマッグ", 20),
                    ("マグマッグ", 34),
                    ("マグマッグ", 36),
                    ("マグマッグ", 18),
                    ("マグマッグ", 36),
                    ("マグマッグ", 18),
                })),
                new FRLGGrass("きわのみさき", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("オニスズメ", 31),
                    ("ナゾノクサ", 30),
                    ("ナゾノクサ", 32),
                    ("クサイハナ", 36),
                    ("オニドリル", 36),
                    ("ニャース", 31),
                    ("クサイハナ", 38),
                    ("コダック", 31),
                    ("ゴルダック", 37),
                    ("ペルシアン", 37),
                    ("ゴルダック", 40),
                    ("ペルシアン", 40),
                })),
                new FRLGGrass("きずなばし", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ポッポ", 32),
                    ("ナゾノクサ", 31),
                    ("ポッポ", 29),
                    ("クサイハナ", 36),
                    ("ピジョン", 34),
                    ("ニャース", 31),
                    ("コンパン", 34),
                    ("コダック", 31),
                    ("ピジョン", 37),
                    ("ペルシアン", 37),
                    ("ピジョン", 40),
                    ("ペルシアン", 40),
                })),
                new FRLGGrass("きのみのもり", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ピジョン", 37),
                    ("クサイハナ", 35),
                    ("ポッポ", 32),
                    ("ナゾノクサ", 30),
                    ("コンパン", 34),
                    ("スリープ", 34),
                    ("タマタマ", 35),
                    ("コダック", 31),
                    ("モルフォン", 37),
                    ("スリーパー", 37),
                    ("モルフォン", 40),
                    ("スリーパー", 40),
                })),
                new FRLGGrass("いてだきのどうくつ 入口/奥", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("パウワウ", 43),
                    ("ゴルバット", 45),
                    ("パウワウ", 45),
                    ("パウワウ", 47),
                    ("ズバット", 40),
                    ("ジュゴン", 49),
                    ("ジュゴン", 51),
                    ("コダック", 41),
                    ("ゴルバット", 48),
                    ("ジュゴン", 53),
                    ("ゴルバット", 48),
                    ("ジュゴン", 53),
                })),
                new FRLGGrass("いてだきのどうくつ 中央/地下", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ウリムー", 25),
                    ("ゴルバット", 45),
                    ("パウワウ", 45),
                    ("ウリムー", 27),
                    ("ズバット", 40),
                    ("ウリムー", 29),
                    ("デリバード", 30),
                    ("ウリムー", 31),
                    ("ゴルバット", 48),
                    ("ウリムー", 23),
                    ("ゴルバット", 48),
                    ("ウリムー", 23),
                })),
                new FRLGGrass("おもいでのとう", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ハネッコ", 10),
                    ("ハネッコ", 12),
                    ("ハネッコ", 8),
                    ("ハネッコ", 14),
                    ("ハネッコ", 10),
                    ("ハネッコ", 12),
                    ("ハネッコ", 16),
                    ("ハネッコ", 6),
                    ("ハネッコ", 8),
                    ("ハネッコ", 14),
                    ("ハネッコ", 8),
                    ("ハネッコ", 14),
                })),
                new FRLGGrass("かえらずのあな 部屋1", 1, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴース", 40),
                    ("ズバット", 37),
                    ("ゴースト", 44),
                    ("ゴースト", 46),
                    ("ゴルバット", 41),
                    ("ゴルバット", 43),
                    ("ゴース", 38),
                    ("ゴースト", 48),
                    ("ゴースト", 50),
                    ("ヤミカラス", 22),
                    ("ゴースト", 52),
                    ("ヤミカラス", 22),
                })),
                new FRLGGrass("かえらずのあな 部屋2", 2, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴース", 40),
                    ("ズバット", 37),
                    ("ゴースト", 44),
                    ("ゴースト", 46),
                    ("ゴルバット", 41),
                    ("ゴルバット", 43),
                    ("ゴース", 38),
                    ("ゴースト", 48),
                    ("ゴースト", 50),
                    ("ヤミカラス", 22),
                    ("ゴースト", 52),
                    ("ヤミカラス", 22),
                })),
                new FRLGGrass("かえらずのあな 部屋3", 3, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴース", 40),
                    ("ズバット", 37),
                    ("ゴースト", 44),
                    ("ゴースト", 46),
                    ("ゴルバット", 41),
                    ("ゴルバット", 43),
                    ("ゴース", 38),
                    ("ゴースト", 48),
                    ("ゴースト", 50),
                    ("ヤミカラス", 22),
                    ("ゴースト", 52),
                    ("ヤミカラス", 22),
                })),
                new FRLGGrass("かえらずのあな 部屋4", 4, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴース", 40),
                    ("ズバット", 37),
                    ("ゴースト", 44),
                    ("ゴースト", 46),
                    ("ゴルバット", 41),
                    ("ゴルバット", 43),
                    ("ゴース", 38),
                    ("ゴースト", 48),
                    ("ゴースト", 50),
                    ("ヤミカラス", 22),
                    ("ゴースト", 52),
                    ("ヤミカラス", 22),
                })),
                new FRLGGrass("かえらずのあな 部屋5", 5, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴース", 40),
                    ("ズバット", 37),
                    ("ゴースト", 44),
                    ("ゴースト", 46),
                    ("ゴルバット", 41),
                    ("ゴルバット", 43),
                    ("ゴース", 38),
                    ("ゴースト", 48),
                    ("ゴースト", 50),
                    ("ヤミカラス", 22),
                    ("ゴースト", 52),
                    ("ヤミカラス", 22),
                })),
                new FRLGGrass("かえらずのあな 部屋6", 6, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴース", 40),
                    ("ズバット", 37),
                    ("ゴースト", 44),
                    ("ゴースト", 46),
                    ("ゴルバット", 41),
                    ("ゴルバット", 43),
                    ("ゴース", 38),
                    ("ゴースト", 48),
                    ("ゴースト", 50),
                    ("ヤミカラス", 22),
                    ("ゴースト", 52),
                    ("ヤミカラス", 22),
                })),
                new FRLGGrass("かえらずのあな 部屋7", 7, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴース", 40),
                    ("ズバット", 37),
                    ("ゴースト", 44),
                    ("ゴースト", 46),
                    ("ゴルバット", 41),
                    ("ゴルバット", 43),
                    ("ゴース", 38),
                    ("ゴースト", 48),
                    ("ゴースト", 50),
                    ("ヤミカラス", 22),
                    ("ゴースト", 52),
                    ("ヤミカラス", 22),
                })),
                new FRLGGrass("かえらずのあな 部屋8", 8, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴース", 40),
                    ("ズバット", 37),
                    ("ゴースト", 44),
                    ("ゴースト", 46),
                    ("ゴルバット", 41),
                    ("ゴルバット", 43),
                    ("ゴース", 38),
                    ("ゴースト", 48),
                    ("ゴースト", 50),
                    ("ヤミカラス", 22),
                    ("ゴースト", 52),
                    ("ヤミカラス", 22),
                })),
                new FRLGGrass("かえらずのあな 部屋9", 9, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴース", 40),
                    ("ズバット", 37),
                    ("ゴースト", 44),
                    ("ゴースト", 46),
                    ("ゴルバット", 41),
                    ("ゴルバット", 43),
                    ("ゴース", 38),
                    ("ゴースト", 48),
                    ("ゴースト", 50),
                    ("ヤミカラス", 22),
                    ("ゴースト", 52),
                    ("ヤミカラス", 22),
                })),
                new FRLGGrass("かえらずのあな 最奥", 10, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴース", 40),
                    ("ズバット", 37),
                    ("ゴースト", 44),
                    ("ゴースト", 46),
                    ("ゴルバット", 41),
                    ("ゴルバット", 43),
                    ("ゴース", 38),
                    ("ゴースト", 48),
                    ("ゴースト", 50),
                    ("ヤミカラス", 22),
                    ("ゴースト", 52),
                    ("ヤミカラス", 22),
                })),
                new FRLGGrass("かえらずのあな 道具部屋", 5, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ゴース", 40),
                    ("ズバット", 37),
                    ("ゴースト", 44),
                    ("ゴースト", 46),
                    ("ゴルバット", 41),
                    ("ヤミカラス", 15),
                    ("ヤミカラス", 20),
                    ("ゴースト", 48),
                    ("ゴースト", 50),
                    ("ヤミカラス", 22),
                    ("ゴースト", 52),
                    ("ヤミカラス", 22),
                })),
                new FRLGGrass("みずのさんぽみち", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("オニスズメ", 44),
                    ("オタチ", 10),
                    ("ナゾノクサ", 44),
                    ("オニドリル", 48),
                    ("オタチ", 15),
                    ("ニャース", 41),
                    ("クサイハナ", 48),
                    ("コダック", 41),
                    ("オニドリル", 50),
                    ("ペルシアン", 47),
                    ("オニドリル", 50),
                    ("ペルシアン", 50),
                })),
                new FRLGGrass("いせきのたに", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ネイティ", 15),
                    ("オニスズメ", 44),
                    ("ヤンヤンマ", 18),
                    ("ウパー", 15),
                    ("オニドリル", 49),
                    ("ニャース", 43),
                    ("ソーナンス", 25),
                    ("コダック", 41),
                    ("ネイティ", 20),
                    ("ペルシアン", 49),
                    ("ネイティ", 20),
                    ("ペルシアン", 52),
                })),
                new FRLGGrass("しるしのはやし", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("イトマル", 9),
                    ("コクーン", 9),
                    ("イトマル", 14),
                    ("キャタピー", 6),
                    ("ビードル", 6),
                    ("ヘラクロス", 15),
                    ("トランセル", 9),
                    ("ヘラクロス", 20),
                    ("レディバ", 9),
                    ("ヘラクロス", 25),
                    ("レディバ", 14),
                    ("ヘラクロス", 30),
                })),
                new FRLGGrass("けいこくいりぐち", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("オニスズメ", 44),
                    ("オタチ", 10),
                    ("ゴマゾウ", 10),
                    ("オニドリル", 48),
                    ("オタチ", 15),
                    ("ニャース", 41),
                    ("オニドリル", 50),
                    ("コダック", 41),
                    ("ゴマゾウ", 15),
                    ("ペルシアン", 47),
                    ("ゴマゾウ", 15),
                    ("ペルシアン", 50),
                })),
                new FRLGGrass("しっぽうけいこく", 20, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("イシツブテ", 46),
                    ("ゴマゾウ", 15),
                    ("カラカラ", 46),
                    ("オニドリル", 50),
                    ("ガラガラ", 52),
                    ("ニャース", 43),
                    ("イワーク", 54),
                    ("エアームド", 30),
                    ("ヨーギラス", 15),
                    ("ペルシアン", 49),
                    ("ヨーギラス", 20),
                    ("ペルシアン", 52),
                })),
                new FRLGGrass("へんげのどうくつ", 5, GBASlot.CreateTable(new (string, uint)[]
                {
                    ("ズバット", 10), ("ズバット", 12), ("ズバット", 8), ("ズバット", 14),
                    ("ズバット", 10), ("ズバット", 12), ("ズバット", 16), ("ズバット", 6),
                    ("ズバット", 8), ("ズバット", 14), ("ズバット", 8), ("ズバット", 14),
                })),
                new FRLGGrass("イレスのせきしつ", 7, UnownSlot.CreateTable(new (string, uint)[]
                {
                    ("A", 25), ("A", 25), ("A", 25), ("A", 25),
                    ("A", 25), ("A", 25), ("A", 25), ("A", 25),
                    ("A", 25), ("A", 25), ("A", 25), ("?", 25),
                })),
                new FRLGGrass("ナザンのせきしつ", 7, UnownSlot.CreateTable(new (string, uint)[]
                {
                    ("C", 25), ("C", 25), ("C", 25), ("D", 25),
                    ("D", 25), ("D", 25), ("H", 25), ("H", 25),
                    ("H", 25), ("U", 25), ("U", 25), ("O", 25),
                })),
                new FRLGGrass("ユゴのせきしつ", 7, UnownSlot.CreateTable(new (string, uint)[]
                {
                    ("N", 25), ("N", 25), ("N", 25), ("N", 25),
                    ("S", 25), ("S", 25), ("S", 25), ("S", 25),
                    ("I", 25), ("I", 25), ("E", 25), ("E", 25),
                })),
                new FRLGGrass("アレボカのせきしつ", 7, UnownSlot.CreateTable(new (string, uint)[]
                {
                    ("P", 25), ("P", 25), ("L", 25), ("L", 25),
                    ("J", 25), ("J", 25), ("R", 25), ("R", 25),
                    ("R", 25), ("Q", 25), ("Q", 25), ("Q", 25),
                })),
                new FRLGGrass("コトーのせきしつ", 7, UnownSlot.CreateTable(new (string, uint)[]
                {
                    ("Y", 25), ("Y", 25), ("T", 25), ("T", 25),
                    ("G", 25), ("G", 25), ("G", 25), ("F", 25),
                    ("F", 25), ("F", 25), ("K", 25), ("K", 25),
                })),
                new FRLGGrass("アヌザのせきしつ", 7, UnownSlot.CreateTable(new (string, uint)[]
                {
                    ("V", 25), ("V", 25), ("V", 25), ("W", 25),
                    ("W", 25), ("W", 25), ("X", 25), ("X", 25),
                    ("M", 25), ("M", 25), ("B", 25), ("B", 25),
                })),
                new FRLGGrass("オリフのせきしつ", 7, UnownSlot.CreateTable(new (string, uint)[]
                {
                    ("Z", 25), ("Z", 25), ("Z", 25), ("Z", 25),
                    ("Z", 25), ("Z", 25), ("Z", 25), ("Z", 25),
                    ("Z", 25), ("Z", 25), ("Z", 25), ("!", 25),
                })),
                };
            }
        }

        public static class Surf
        {
            public static GBAMap[] SelectMap(string mapNameKeyWord = "")
                => tables.Where(_ => _.MapName.Contains(mapNameKeyWord)).ToArray();

            private static readonly GBAMap[] tables;
            static Surf()
            {
                tables = new GBAMap[]
                {
                new FRLGSurf("4ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 6),
                    ("メノクラゲ", 10, 11),
                    ("メノクラゲ", 20, 11),
                    ("メノクラゲ", 30, 6),
                    ("メノクラゲ", 35, 6),
                })),
                new FRLGSurf("6ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コダック", 20, 6),
                    ("コダック", 20, 6),
                    ("コダック", 25, 6),
                    ("コダック", 30, 6),
                    ("コダック", 35, 6),
                })),
                new FRLGSurf("10ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 6),
                    ("メノクラゲ", 10, 11),
                    ("メノクラゲ", 20, 11),
                    ("メノクラゲ", 30, 6),
                    ("メノクラゲ", 35, 6),
                })),
                new FRLGSurf("11ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 6),
                    ("メノクラゲ", 10, 11),
                    ("メノクラゲ", 20, 11),
                    ("メノクラゲ", 30, 6),
                    ("メノクラゲ", 35, 6),
                })),
                new FRLGSurf("12ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 6),
                    ("メノクラゲ", 10, 11),
                    ("メノクラゲ", 20, 11),
                    ("メノクラゲ", 30, 6),
                    ("メノクラゲ", 35, 6),
                })),
                new FRLGSurf("13ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 6),
                    ("メノクラゲ", 10, 11),
                    ("メノクラゲ", 20, 11),
                    ("メノクラゲ", 30, 6),
                    ("メノクラゲ", 35, 6),
                })),
                new FRLGSurf("19ばんすいどう", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 6),
                    ("メノクラゲ", 10, 11),
                    ("メノクラゲ", 20, 11),
                    ("メノクラゲ", 30, 6),
                    ("メノクラゲ", 35, 6),
                })),
                new FRLGSurf("20ばんすいどう", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 6),
                    ("メノクラゲ", 10, 11),
                    ("メノクラゲ", 20, 11),
                    ("メノクラゲ", 30, 6),
                    ("メノクラゲ", 35, 6),
                })),
                new FRLGSurf("21ばんすいどう", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 6),
                    ("メノクラゲ", 10, 11),
                    ("メノクラゲ", 20, 11),
                    ("メノクラゲ", 30, 6),
                    ("メノクラゲ", 35, 6),
                })),
                new FRLGSurf("22ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コダック", 20, 6),
                    ("コダック", 20, 6),
                    ("コダック", 25, 6),
                    ("コダック", 30, 6),
                    ("コダック", 35, 6),
                })),
                new FRLGSurf("23ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コダック", 20, 6),
                    ("コダック", 20, 6),
                    ("コダック", 25, 6),
                    ("コダック", 30, 6),
                    ("コダック", 35, 6),
                })),
                new FRLGSurf("24ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 6),
                    ("メノクラゲ", 10, 11),
                    ("メノクラゲ", 20, 11),
                    ("メノクラゲ", 30, 6),
                    ("メノクラゲ", 35, 6),
                })),
                new FRLGSurf("25ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コダック", 20, 6),
                    ("コダック", 20, 6),
                    ("コダック", 25, 6),
                    ("コダック", 30, 6),
                    ("コダック", 35, 6),
                })),
                new FRLGSurf("1のしま", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 16),
                    ("メノクラゲ", 20, 16),
                    ("メノクラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                })),
                new FRLGSurf("4のしま", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ウパー", 5, 11),
                    ("コダック", 5, 31),
                    ("ウパー", 15, 11),
                    ("ウパー", 15, 11),
                    ("ウパー", 15, 11),
                })),
                new FRLGSurf("5のしま", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("ハネッコ", 5, 11),
                    ("メノクラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                })),
                new FRLGSurf("5のしま あきち", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("ハネッコ", 5, 11),
                    ("メノクラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                })),
                new FRLGSurf("マサラタウン", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 6),
                    ("メノクラゲ", 10, 11),
                    ("メノクラゲ", 20, 11),
                    ("メノクラゲ", 30, 6),
                    ("メノクラゲ", 35, 6),
                })),
                new FRLGSurf("トキワシティ", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コダック", 20, 6),
                    ("コダック", 20, 6),
                    ("コダック", 25, 6),
                    ("コダック", 30, 6),
                    ("コダック", 35, 6),
                })),
                new FRLGSurf("ハナダシティ", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 6),
                    ("メノクラゲ", 10, 11),
                    ("メノクラゲ", 20, 11),
                    ("メノクラゲ", 30, 6),
                    ("メノクラゲ", 35, 6),
                })),
                new FRLGSurf("クチバシティ", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 6),
                    ("メノクラゲ", 10, 11),
                    ("メノクラゲ", 20, 11),
                    ("メノクラゲ", 30, 6),
                    ("メノクラゲ", 35, 6),
                })),
                new FRLGSurf("タマムシシティ", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コダック", 5, 6),
                    ("コダック", 10, 11),
                    ("コダック", 20, 11),
                    ("コダック", 30, 11),
                    ("ドガース", 30, 11),
                })),
                new FRLGSurf("セキチクシティ", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コダック", 20, 6),
                    ("コダック", 20, 6),
                    ("コダック", 25, 6),
                    ("コダック", 30, 6),
                    ("コダック", 35, 6),
                })),
                new FRLGSurf("グレンじま", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 6),
                    ("メノクラゲ", 10, 11),
                    ("メノクラゲ", 20, 11),
                    ("メノクラゲ", 30, 6),
                    ("メノクラゲ", 35, 6),
                })),
                new FRLGSurf("サファリゾーン", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コダック", 20, 6),
                    ("コダック", 20, 6),
                    ("コダック", 25, 6),
                    ("コダック", 30, 6),
                    ("コダック", 35, 6),
                })),
                new FRLGSurf("ふたごじま", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("パウワウ", 25, 11),
                    ("タッツー", 25, 6),
                    ("ジュゴン", 35, 6),
                    ("コダック", 30, 11),
                    ("ゴルダック", 35, 6),
                })),
                new FRLGSurf("ハナダのどうくつ 1F", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コダック", 30, 11),
                    ("ゴルダック", 40, 11),
                    ("ゴルダック", 45, 11),
                    ("コダック", 40, 11),
                    ("コダック", 40, 11),
                })),
                new FRLGSurf("ハナダのどうくつ B1F", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コダック", 40, 11),
                    ("ゴルダック", 50, 11),
                    ("ゴルダック", 55, 11),
                    ("コダック", 50, 11),
                    ("コダック", 50, 11),
                })),
                new FRLGSurf("ほてりのみち", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 16),
                    ("メノクラゲ", 20, 16),
                    ("メノクラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                })),
                new FRLGSurf("たからのはま", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 16),
                    ("メノクラゲ", 20, 16),
                    ("メノクラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                })),
                new FRLGSurf("きわのみさき", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コダック", 5, 16),
                    ("コダック", 20, 16),
                    ("コダック", 35, 6),
                    ("ゴルダック", 35, 6),
                    ("ゴルダック", 35, 6),
                })),
                new FRLGSurf("きずなばし", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 16),
                    ("メノクラゲ", 20, 16),
                    ("メノクラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                })),
                new FRLGSurf("きのみのもり", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コダック", 5, 16),
                    ("コダック", 20, 16),
                    ("コダック", 35, 6),
                    ("ゴルダック", 35, 6),
                    ("ゴルダック", 35, 6),
                })),
                new FRLGSurf("いてだきのどうくつ 入口", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("パウワウ", 5, 31),
                    ("コダック", 5, 31),
                    ("ジュゴン", 35, 6),
                    ("ウパー", 5, 11),
                    ("ウパー", 5, 11),
                })),
                new FRLGSurf("いてだきのどうくつ 奥", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 16),
                    ("メノクラゲ", 20, 16),
                    ("メノクラゲ", 35, 11),
                    ("ドククラゲ", 35, 11),
                    ("ラプラス", 30, 16),
                })),
                new FRLGSurf("おもいでのとう", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("ハネッコ", 5, 11),
                    ("メノクラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                })),
                new FRLGSurf("ゴージャスリゾート", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 31),
                    ("ハネッコ", 5, 11),
                    ("メノクラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                })),
                new FRLGSurf("みずのめいろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 16),
                    ("ハネッコ", 5, 11),
                    ("メノクラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                })),
                new FRLGSurf("みずのさんぽみち", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 16),
                    ("メノクラゲ", 20, 16),
                    ("メノクラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                })),
                new FRLGSurf("いせきのたに", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ウパー", 5, 16),
                    ("ウパー", 10, 11),
                    ("ウパー", 15, 11),
                    ("ウパー", 20, 6),
                    ("ウパー", 20, 6),
                })),
                new FRLGSurf("みどりのさんぽみち", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 16),
                    ("メノクラゲ", 20, 16),
                    ("メノクラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                })),
                new FRLGSurf("はずれのしま", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 16),
                    ("メノクラゲ", 20, 16),
                    ("メノクラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                })),
                new FRLGSurf("トレーナータワー", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 16),
                    ("メノクラゲ", 20, 16),
                    ("メノクラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                })),
                new FRLGSurf("アスカナいせき", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("メノクラゲ", 5, 16),
                    ("メノクラゲ", 20, 16),
                    ("メノクラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                    ("ドククラゲ", 35, 6),
                }))
                };
            }
        }

        public static class OldRod
        {
            public static GBAMap[] SelectMap(string mapNameKeyWord = "")
                => tables.Where(_ => _.MapName.Contains(mapNameKeyWord)).ToArray();

            private static readonly GBAMap[] tables;
            static OldRod()
            {
                tables = new GBAMap[]
                {
                new FRLGOldRod("4ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("6ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("10ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("11ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("12ばんどうろ", 60, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("13ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("19ばんすいどう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("20ばんすいどう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("21ばんすいどう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("22ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("23ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("24ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("25ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("1のしま", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("4のしま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("5のしま", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("5のしま あきち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("マサラタウン", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 6),
                    ("コイキング", 5, 6),
                })),
                new FRLGOldRod("トキワシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("ハナダシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("クチバシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("タマムシシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("セキチクシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("グレンじま", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("サファリゾーン", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("ふたごじま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("ハナダのどうくつ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("ほてりのみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("たからのはま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("きわのみさき", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("きずなばし", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("きのみのもり", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("いてだきのどうくつ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("おもいでのとう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("ゴージャスリゾート", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("みずのめいろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("みずのさんぽみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("いせきのたに", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("みどりのさんぽみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("はずれのしま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("トレーナータワー", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),
                new FRLGOldRod("アスカナいせき", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 1),
                    ("コイキング", 5, 1),
                })),

                };
            }
        }

        public static class GoodRod
        {
            public static GBAMap[] SelectMap(string mapNameKeyWord = "")
                => tables.Where(_ => _.MapName.Contains(mapNameKeyWord)).ToArray();

            private static readonly GBAMap[] tables;
            static GoodRod()
            {
                tables = new GBAMap[]
                {
                new FRLGGoodRod("4ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("6ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("10ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("11ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("12ばんどうろ", 60, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("13ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("19ばんすいどう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("20ばんすいどう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("21ばんすいどう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("22ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("23ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("24ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("25ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("1のしま", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("4のしま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("5のしま", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("5のしま あきち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("マサラタウン", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("トキワシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("ハナダシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("クチバシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("タマムシシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 11),
                    ("コイキング", 5, 11),
                    ("コイキング", 5, 11),
                })),
                new FRLGGoodRod("セキチクシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("トサキント", 5, 11),
                    ("コイキング", 5, 11),
                    ("ニョロモ", 5, 11),
                })),
                new FRLGGoodRod("グレンじま", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("サファリゾーン", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("トサキント", 5, 11),
                    ("コイキング", 5, 11),
                    ("ニョロモ", 5, 11),
                })),
                new FRLGGoodRod("ふたごじま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("ハナダのどうくつ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("ほてりのみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("たからのはま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("きわのみさき", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("きずなばし", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("きのみのもり", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("トサキント", 5, 11),
                    ("コイキング", 5, 11),
                    ("ニョロモ", 5, 11),
                })),
                new FRLGGoodRod("いてだきのどうくつ 入口", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("いてだきのどうくつ 奥", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("おもいでのとう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("ゴージャスリゾート", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("みずのめいろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("みずのさんぽみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("いせきのたに", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("みどりのさんぽみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("はずれのしま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("トレーナータワー", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("アスカナいせき", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                };
            }
        }

        public static class SuperRod
        {
            public static GBAMap[] SelectMap(string mapNameKeyWord = "")
                => tables.Where(_ => _.MapName.Contains(mapNameKeyWord)).ToArray();

            private static readonly GBAMap[] tables;
            static SuperRod()
            {
                tables = new GBAMap[]
                {
                new FRLGSuperRod("4ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("タッツー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("タッツー", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("6ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("コダック", 15, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("10ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("タッツー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("タッツー", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("11ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("タッツー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("タッツー", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("12ばんどうろ", 60, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("タッツー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("タッツー", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("13ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("タッツー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("タッツー", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("19ばんすいどう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("タッツー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("20ばんすいどう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("タッツー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("21ばんすいどう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("タッツー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("22ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("コダック", 15, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("23ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("コダック", 15, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("24ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("タッツー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("タッツー", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("25ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("コダック", 15, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("1のしま", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("シェルダー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("4のしま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("コダック", 15, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("5のしまあきち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("ハリーセン", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("5のしま", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("シェルダー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("マサラタウン", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("シェルダー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("トキワシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("コダック", 15, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("ハナダシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("タッツー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("タッツー", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("クチバシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("シェルダー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("タッツー", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("タマムシシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 15, 11),
                    ("コイキング", 15, 11),
                    ("コイキング", 15, 11),
                    ("コイキング", 25, 11),
                    ("ベトベター", 30, 11),
                })),
                new FRLGSuperRod("セキチクシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("トサキント", 15, 11),
                    ("アズマオウ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("コダック", 15, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("グレンじま", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("シェルダー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("サファリゾーン", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("トサキント", 15, 11),
                    ("アズマオウ", 20, 11),
                    ("ミニリュウ", 15, 11),
                    ("コダック", 15, 21),
                    ("ハクリュー", 25, 11),
                })),
                new FRLGSuperRod("ふたごじま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("タッツー", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("コダック", 15, 11),
                    ("ギャラドス", 25, 11),
                })),
                new FRLGSuperRod("ハナダのどうくつ 1F", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("コダック", 15, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("ハナダのどうくつ B1F", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("コダック", 15, 11),
                    ("ギャラドス", 25, 11),
                })),
                new FRLGSuperRod("ほてりのみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("タッツー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("たからのはま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("タッツー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("きわのみさき", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("コダック", 15, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("きずなばし", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("タッツー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("きのみのもり", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("トサキント", 15, 11),
                    ("アズマオウ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("コダック", 15, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("いてだきのどうくつ 入口", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("コダック", 15, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("いてだきのどうくつ 奥", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("シェルダー", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("おもいでのとう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("ハリーセン", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("ゴージャスリゾート", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("ハリーセン", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("みずのめいろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("ハリーセン", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("みずのさんぽみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("ハリーセン", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("いせきのたに", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("コダック", 15, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("みどりのさんぽみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("ハリーセン", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("はずれのしま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("ハリーセン", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("トレーナータワー", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("ハリーセン", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                new FRLGSuperRod("アスカナいせき", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("タッツー", 15, 11),
                    ("ハリーセン", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("シードラ", 25, 11),
                    ("コダック", 25, 11),
                })),
                };
            }
        }

        public static class RockSmash
        {
            public static GBAMap[] SelectMap(string mapNameKeyWord = "")
                => tables.Where(_ => _.MapName.Contains(mapNameKeyWord)).ToArray();

            private static readonly GBAMap[] tables;
            static RockSmash()
            {
                tables = new GBAMap[]
                {
                new FRLGRockSmash("イワヤマトンネル", 50, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 5, 16),
                    ("イシツブテ", 10, 11),
                    ("イシツブテ", 15, 16),
                    ("ゴローン", 25, 16),
                    ("ゴローン", 30, 11),
                })),
                new FRLGRockSmash("ハナダのどうくつ 1F", 50, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 30, 11),
                    ("ゴローン", 40, 11),
                    ("ゴローン", 45, 11),
                    ("イシツブテ", 40, 11),
                    ("イシツブテ", 40, 11),
                })),
                new FRLGRockSmash("ハナダのどうくつ 2F", 50, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 35, 11),
                    ("ゴローン", 45, 11),
                    ("ゴローン", 50, 11),
                    ("イシツブテ", 45, 11),
                    ("イシツブテ", 45, 11),
                })),
                new FRLGRockSmash("ハナダのどうくつ B1F", 50, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 40, 11),
                    ("ゴローン", 50, 11),
                    ("ゴローン", 55, 11),
                    ("イシツブテ", 50, 11),
                    ("イシツブテ", 50, 11),
                })),
                new FRLGRockSmash("ともしびやま 外/洞窟(左)", 50, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 5, 16),
                    ("イシツブテ", 10, 11),
                    ("イシツブテ", 15, 16),
                    ("ゴローン", 25, 16),
                    ("ゴローン", 30, 11),
                })),
                new FRLGRockSmash("ともしびやま 洞窟(右) 1F-B2F", 50, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 25, 11),
                    ("ゴローン", 30, 16),
                    ("ゴローン", 35, 16),
                    ("イシツブテ", 30, 11),
                    ("イシツブテ", 30, 11),
                })),
                new FRLGRockSmash("ともしびやま 洞窟(右) B3F", 50, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("マグマッグ", 15, 11),
                    ("マグマッグ", 25, 11),
                    ("マグカルゴ", 40, 6),
                    ("マグカルゴ", 35, 11),
                    ("マグカルゴ", 25, 11),
                })),
                new FRLGRockSmash("ほてりのみち", 25, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 5, 16),
                    ("イシツブテ", 10, 11),
                    ("イシツブテ", 15, 16),
                    ("ゴローン", 25, 16),
                    ("ゴローン", 30, 11),
                })),
                new FRLGRockSmash("しっぽうけいこく", 25, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 25, 11),
                    ("ゴローン", 30, 16),
                    ("ゴローン", 35, 16),
                    ("イシツブテ", 30, 11),
                    ("イシツブテ", 30, 11),
                })),
                };
            }
        }

    }

}