using System.Linq;
using System.Collections.Generic;
using System.Text;

namespace Pokemon3genRNGLibrary.MapData
{
    public static class LGMapData
    {
        public static class Field
        {
            public static GBAMap[] SelectMap(string mapNameKeyWord = "")
                => tables.Where(_ => _.MapName.Contains(mapNameKeyWord)).ToArray();

            private static readonly GBAMap[] tables;
            static Field()
            {
                tables = new GBAMap[]
                {
                    new FRLGGrass("1ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ポッポ", 3, 1),
                        ("コラッタ", 3, 1),
                        ("ポッポ", 3, 1),
                        ("コラッタ", 3, 1),
                        ("ポッポ", 2, 1),
                        ("コラッタ", 2, 1),
                        ("ポッポ", 3, 1),
                        ("コラッタ", 3, 1),
                        ("ポッポ", 4, 1),
                        ("コラッタ", 4, 1),
                        ("ポッポ", 5, 1),
                        ("コラッタ", 4, 1),
                    })),
                    new FRLGGrass("2ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コラッタ", 3, 1),
                        ("ポッポ", 3, 1),
                        ("コラッタ", 4, 1),
                        ("ポッポ", 4, 1),
                        ("コラッタ", 2, 1),
                        ("ポッポ", 2, 1),
                        ("コラッタ", 5, 1),
                        ("ポッポ", 5, 1),
                        ("キャタピー", 4, 1),
                        ("ビードル", 4, 1),
                        ("キャタピー", 5, 1),
                        ("ビードル", 5, 1),
                    })),
                    new FRLGGrass("3ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("オニスズメ", 6, 1),
                        ("ポッポ", 6, 1),
                        ("オニスズメ", 7, 1),
                        ("マンキー", 7, 1),
                        ("ニドラン♀", 6, 1),
                        ("ポッポ", 7, 1),
                        ("オニスズメ", 8, 1),
                        ("プリン", 3, 1),
                        ("ニドラン♀", 7, 1),
                        ("プリン", 5, 1),
                        ("ニドラン♂", 6, 1),
                        ("プリン", 7, 1),
                    })),
                    new FRLGGrass("4ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("オニスズメ", 10, 1),
                        ("コラッタ", 10, 1),
                        ("サンド", 6, 1),
                        ("サンド", 10, 1),
                        ("オニスズメ", 8, 1),
                        ("コラッタ", 8, 1),
                        ("オニスズメ", 12, 1),
                        ("コラッタ", 12, 1),
                        ("マンキー", 10, 1),
                        ("サンド", 8, 1),
                        ("マンキー", 12, 1),
                        ("サンド", 12, 1),
                    })),
                    new FRLGGrass("5ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ニャース", 10, 1),
                        ("ポッポ", 13, 1),
                        ("マダツボミ", 13, 1),
                        ("ニャース", 12, 1),
                        ("マダツボミ", 15, 1),
                        ("ポッポ", 15, 1),
                        ("マダツボミ", 16, 1),
                        ("ポッポ", 16, 1),
                        ("ポッポ", 15, 1),
                        ("ニャース", 14, 1),
                        ("ポッポ", 15, 1),
                        ("ニャース", 16, 1),
                    })),
                    new FRLGGrass("6ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ニャース", 10, 1),
                        ("ポッポ", 13, 1),
                        ("マダツボミ", 13, 1),
                        ("ニャース", 12, 1),
                        ("マダツボミ", 15, 1),
                        ("ポッポ", 15, 1),
                        ("マダツボミ", 16, 1),
                        ("ポッポ", 16, 1),
                        ("ポッポ", 15, 1),
                        ("ニャース", 14, 1),
                        ("ポッポ", 15, 1),
                        ("ニャース", 16, 1),
                    })),
                    new FRLGGrass("7ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ポッポ", 19, 1),
                        ("ニャース", 17, 1),
                        ("マダツボミ", 19, 1),
                        ("ニャース", 18, 1),
                        ("ポッポ", 22, 1),
                        ("マダツボミ", 22, 1),
                        ("ロコン", 18, 1),
                        ("ロコン", 20, 1),
                        ("ニャース", 17, 1),
                        ("ニャース", 19, 1),
                        ("ニャース", 17, 1),
                        ("ニャース", 20, 1),
                    })),
                    new FRLGGrass("8ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ポッポ", 18, 1),
                        ("ニャース", 18, 1),
                        ("ロコン", 16, 1),
                        ("ポッポ", 20, 1),
                        ("ニャース", 20, 1),
                        ("サンド", 17, 1),
                        ("ロコン", 17, 1),
                        ("サンド", 19, 1),
                        ("サンド", 17, 1),
                        ("ロコン", 15, 1),
                        ("サンド", 17, 1),
                        ("ロコン", 18, 1),
                    })),
                    new FRLGGrass("9ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("オニスズメ", 16, 1),
                        ("コラッタ", 16, 1),
                        ("サンド", 11, 1),
                        ("サンド", 15, 1),
                        ("オニスズメ", 13, 1),
                        ("コラッタ", 14, 1),
                        ("オニスズメ", 17, 1),
                        ("コラッタ", 17, 1),
                        ("コラッタ", 14, 1),
                        ("サンド", 13, 1),
                        ("コラッタ", 14, 1),
                        ("サンド", 17, 1),
                    })),
                    new FRLGGrass("10ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("オニスズメ", 16, 1),
                        ("ビリリダマ", 16, 1),
                        ("サンド", 11, 1),
                        ("サンド", 15, 1),
                        ("オニスズメ", 13, 1),
                        ("ビリリダマ", 14, 1),
                        ("オニスズメ", 17, 1),
                        ("ビリリダマ", 17, 1),
                        ("ビリリダマ", 14, 1),
                        ("サンド", 13, 1),
                        ("ビリリダマ", 14, 1),
                        ("サンド", 17, 1),
                    })),
                    new FRLGGrass("11ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("サンド", 14, 1),
                        ("オニスズメ", 15, 1),
                        ("サンド", 12, 1),
                        ("オニスズメ", 13, 1),
                        ("スリープ", 11, 1),
                        ("スリープ", 13, 1),
                        ("サンド", 15, 1),
                        ("オニスズメ", 17, 1),
                        ("サンド", 12, 1),
                        ("スリープ", 15, 1),
                        ("サンド", 12, 1),
                        ("スリープ", 15, 1),
                    })),
                    new FRLGGrass("12ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("マダツボミ", 24, 1),
                        ("コンパン", 24, 1),
                        ("マダツボミ", 22, 1),
                        ("ポッポ", 23, 1),
                        ("ポッポ", 25, 1),
                        ("コンパン", 26, 1),
                        ("マダツボミ", 26, 1),
                        ("ポッポ", 27, 1),
                        ("ポッポ", 23, 1),
                        ("ウツドン", 28, 1),
                        ("ポッポ", 23, 1),
                        ("ウツドン", 30, 1),
                    })),
                    new FRLGGrass("13ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("マダツボミ", 24, 1),
                        ("コンパン", 24, 1),
                        ("マダツボミ", 22, 1),
                        ("ポッポ", 27, 1),
                        ("ポッポ", 25, 1),
                        ("コンパン", 26, 1),
                        ("マダツボミ", 26, 1),
                        ("メタモン", 25, 1),
                        ("ピジョン", 29, 1),
                        ("ウツドン", 28, 1),
                        ("ピジョン", 29, 1),
                        ("ウツドン", 30, 1),
                    })),
                    new FRLGGrass("14ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("マダツボミ", 24, 1),
                        ("コンパン", 24, 1),
                        ("マダツボミ", 22, 1),
                        ("メタモン", 23, 1),
                        ("ポッポ", 27, 1),
                        ("コンパン", 26, 1),
                        ("マダツボミ", 26, 1),
                        ("ウツドン", 30, 1),
                        ("メタモン", 23, 1),
                        ("ピジョン", 29, 1),
                        ("メタモン", 23, 1),
                        ("ピジョン", 29, 1),
                    })),
                    new FRLGGrass("15ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("マダツボミ", 24, 1),
                        ("コンパン", 24, 1),
                        ("マダツボミ", 22, 1),
                        ("ポッポ", 27, 1),
                        ("ポッポ", 25, 1),
                        ("コンパン", 26, 1),
                        ("マダツボミ", 26, 1),
                        ("メタモン", 25, 1),
                        ("ピジョン", 29, 1),
                        ("ウツドン", 28, 1),
                        ("ピジョン", 29, 1),
                        ("ウツドン", 30, 1),
                    })),
                    new FRLGGrass("16ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("オニスズメ", 20, 1),
                        ("ドードー", 18, 1),
                        ("コラッタ", 18, 1),
                        ("コラッタ", 20, 1),
                        ("オニスズメ", 22, 1),
                        ("ドードー", 20, 1),
                        ("コラッタ", 22, 1),
                        ("ドードー", 22, 1),
                        ("コラッタ", 18, 1),
                        ("ラッタ", 23, 1),
                        ("コラッタ", 18, 1),
                        ("ラッタ", 25, 1),
                    })),
                    new FRLGGrass("17ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("オニスズメ", 20, 1),
                        ("ドードー", 24, 1),
                        ("オニスズメ", 22, 1),
                        ("ドードー", 26, 1),
                        ("ラッタ", 25, 1),
                        ("ラッタ", 27, 1),
                        ("ドードー", 28, 1),
                        ("ラッタ", 29, 1),
                        ("コラッタ", 22, 1),
                        ("オニドリル", 25, 1),
                        ("コラッタ", 22, 1),
                        ("オニドリル", 27, 1),
                    })),
                    new FRLGGrass("18ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("オニスズメ", 20, 1),
                        ("ドードー", 24, 1),
                        ("オニスズメ", 22, 1),
                        ("ドードー", 26, 1),
                        ("ラッタ", 25, 1),
                        ("オニドリル", 25, 1),
                        ("ドードー", 28, 1),
                        ("ラッタ", 29, 1),
                        ("コラッタ", 22, 1),
                        ("オニドリル", 27, 1),
                        ("コラッタ", 22, 1),
                        ("オニドリル", 29, 1),
                    })),
                    new FRLGGrass("21ばんすいどう", 15, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("モンジャラ", 22, 1),
                        ("モンジャラ", 23, 1),
                        ("モンジャラ", 24, 1),
                        ("モンジャラ", 21, 1),
                        ("モンジャラ", 25, 1),
                        ("モンジャラ", 20, 1),
                        ("モンジャラ", 19, 1),
                        ("モンジャラ", 26, 1),
                        ("モンジャラ", 18, 1),
                        ("モンジャラ", 27, 1),
                        ("モンジャラ", 17, 1),
                        ("モンジャラ", 28, 1),
                    })),
                    new FRLGGrass("22ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コラッタ", 3, 1),
                        ("マンキー", 3, 1),
                        ("コラッタ", 4, 1),
                        ("マンキー", 4, 1),
                        ("コラッタ", 2, 1),
                        ("マンキー", 2, 1),
                        ("オニスズメ", 3, 1),
                        ("オニスズメ", 5, 1),
                        ("コラッタ", 5, 1),
                        ("マンキー", 5, 1),
                        ("コラッタ", 5, 1),
                        ("マンキー", 5, 1),
                    })),
                    new FRLGGrass("23ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("マンキー", 32, 1),
                        ("オニドリル", 40, 1),
                        ("マンキー", 34, 1),
                        ("オニスズメ", 34, 1),
                        ("サンド", 32, 1),
                        ("サンド", 34, 1),
                        ("オコリザル", 42, 1),
                        ("サンドパン", 44, 1),
                        ("オニスズメ", 32, 1),
                        ("オニドリル", 42, 1),
                        ("オニスズメ", 32, 1),
                        ("オニドリル", 44, 1),
                    })),
                    new FRLGGrass("24ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ビードル", 7, 1),
                        ("キャタピー", 7, 1),
                        ("ポッポ", 11, 1),
                        ("マダツボミ", 12, 1),
                        ("マダツボミ", 13, 1),
                        ("ケーシィ", 10, 1),
                        ("ポッポ", 13, 1),
                        ("マダツボミ", 14, 1),
                        ("トランセル", 8, 1),
                        ("ケーシィ", 8, 1),
                        ("コクーン", 8, 1),
                        ("ケーシィ", 12, 1),
                    })),
                    new FRLGGrass("25ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ビードル", 8, 1),
                        ("キャタピー", 8, 1),
                        ("ポッポ", 13, 1),
                        ("マダツボミ", 14, 1),
                        ("マダツボミ", 13, 1),
                        ("ケーシィ", 11, 1),
                        ("ポッポ", 11, 1),
                        ("マダツボミ", 12, 1),
                        ("トランセル", 9, 1),
                        ("ケーシィ", 9, 1),
                        ("コクーン", 9, 1),
                        ("ケーシィ", 13, 1),
                    })),
                    new FRLGGrass("3のしま みなと", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ノコッチ", 15, 1),
                        ("ノコッチ", 15, 1),
                        ("ノコッチ", 10, 1),
                        ("ノコッチ", 10, 1),
                        ("ノコッチ", 20, 1),
                        ("ノコッチ", 20, 1),
                        ("ノコッチ", 25, 1),
                        ("ノコッチ", 30, 1),
                        ("ノコッチ", 25, 1),
                        ("ノコッチ", 30, 1),
                        ("ノコッチ", 5, 1),
                        ("ノコッチ", 35, 1),
                    })),
                    new FRLGGrass("5のしま あきち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ポッポ", 44, 1),
                        ("オタチ", 10, 1),
                        ("ピジョン", 48, 1),
                        ("ハネッコ", 10, 1),
                        ("オタチ", 15, 1),
                        ("ニャース", 41, 1),
                        ("ハネッコ", 15, 1),
                        ("ヤドン", 41, 1),
                        ("ピジョン", 50, 1),
                        ("ペルシアン", 47, 1),
                        ("ピジョン", 50, 1),
                        ("ペルシアン", 50, 1),
                    })),
                    new FRLGGrass("トキワのもり", 15, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("キャタピー", 4, 1),
                        ("ビードル", 4, 1),
                        ("キャタピー", 5, 1),
                        ("ビードル", 5, 1),
                        ("キャタピー", 3, 1),
                        ("ビードル", 3, 1),
                        ("コクーン", 5, 1),
                        ("トランセル", 5, 1),
                        ("トランセル", 4, 1),
                        ("ピカチュウ", 3, 1),
                        ("トランセル", 6, 1),
                        ("ピカチュウ", 5, 1),
                    })),
                    new FRLGGrass("おつきみやま 1F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ズバット", 7, 1),
                        ("ズバット", 8, 1),
                        ("イシツブテ", 7, 1),
                        ("ズバット", 9, 1),
                        ("ズバット", 10, 1),
                        ("イシツブテ", 8, 1),
                        ("イシツブテ", 9, 1),
                        ("パラス", 8, 1),
                        ("ズバット", 7, 1),
                        ("ズバット", 7, 1),
                        ("ズバット", 7, 1),
                        ("ピッピ", 8, 1),
                    })),
                    new FRLGGrass("おつきみやま B1F", 5, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("パラス", 7, 1),
                        ("パラス", 8, 1),
                        ("パラス", 5, 1),
                        ("パラス", 6, 1),
                        ("パラス", 9, 1),
                        ("パラス", 10, 1),
                        ("パラス", 7, 1),
                        ("パラス", 8, 1),
                        ("パラス", 5, 1),
                        ("パラス", 6, 1),
                        ("パラス", 9, 1),
                        ("パラス", 10, 1),
                    })),
                    new FRLGGrass("おつきみやま B2F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ズバット", 8, 1),
                        ("イシツブテ", 9, 1),
                        ("ズバット", 9, 1),
                        ("ズバット", 10, 1),
                        ("イシツブテ", 10, 1),
                        ("パラス", 10, 1),
                        ("パラス", 12, 1),
                        ("ピッピ", 10, 1),
                        ("ズバット", 11, 1),
                        ("ズバット", 11, 1),
                        ("ズバット", 11, 1),
                        ("ピッピ", 12, 1),
                    })),
                    new FRLGGrass("ディグダのあな", 5, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ディグダ", 18, 1),
                        ("ディグダ", 19, 1),
                        ("ディグダ", 17, 1),
                        ("ディグダ", 15, 1),
                        ("ディグダ", 16, 1),
                        ("ディグダ", 20, 1),
                        ("ディグダ", 21, 1),
                        ("ディグダ", 22, 1),
                        ("ディグダ", 17, 1),
                        ("ダグトリオ", 29, 1),
                        ("ディグダ", 17, 1),
                        ("ダグトリオ", 31, 1),
                    })),
                    new FRLGGrass("むじんはつでんしょ", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ビリリダマ", 22, 1),
                        ("コイル", 22, 1),
                        ("ビリリダマ", 25, 1),
                        ("コイル", 25, 1),
                        ("ピカチュウ", 22, 1),
                        ("ピカチュウ", 24, 1),
                        ("レアコイル", 31, 1),
                        ("レアコイル", 34, 1),
                        ("ピカチュウ", 26, 1),
                        ("レアコイル", 31, 1),
                        ("ピカチュウ", 26, 1),
                        ("レアコイル", 34, 1),
                    })),
                    new FRLGGrass("イワヤマトンネル 1F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ズバット", 15, 1),
                        ("イシツブテ", 16, 1),
                        ("マンキー", 16, 1),
                        ("イシツブテ", 17, 1),
                        ("ズバット", 16, 1),
                        ("ワンリキー", 16, 1),
                        ("マンキー", 17, 1),
                        ("ワンリキー", 17, 1),
                        ("イシツブテ", 15, 1),
                        ("イワーク", 13, 1),
                        ("イシツブテ", 15, 1),
                        ("イワーク", 15, 1),
                    })),
                    new FRLGGrass("イワヤマトンネル B1F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ズバット", 16, 1),
                        ("イシツブテ", 17, 1),
                        ("マンキー", 17, 1),
                        ("イシツブテ", 16, 1),
                        ("ズバット", 15, 1),
                        ("ワンリキー", 17, 1),
                        ("マンキー", 16, 1),
                        ("イワーク", 13, 1),
                        ("イシツブテ", 15, 1),
                        ("イワーク", 15, 1),
                        ("イシツブテ", 15, 1),
                        ("イワーク", 17, 1),
                    })),
                    new FRLGGrass("ポケモンタワー 3F", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ゴース", 15, 1),
                        ("ゴース", 16, 1),
                        ("ゴース", 17, 1),
                        ("ゴース", 13, 1),
                        ("ゴース", 14, 1),
                        ("ゴース", 18, 1),
                        ("ゴース", 19, 1),
                        ("カラカラ", 15, 1),
                        ("ゴース", 17, 1),
                        ("カラカラ", 17, 1),
                        ("ゴース", 17, 1),
                        ("ゴースト", 20, 1),
                    })),
                    new FRLGGrass("ポケモンタワー 4F", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ゴース", 15, 1),
                        ("ゴース", 16, 1),
                        ("ゴース", 17, 1),
                        ("ゴース", 13, 1),
                        ("ゴース", 14, 1),
                        ("ゴース", 18, 1),
                        ("ゴースト", 20, 1),
                        ("カラカラ", 15, 1),
                        ("ゴース", 17, 1),
                        ("カラカラ", 17, 1),
                        ("ゴース", 17, 1),
                        ("ゴース", 19, 1),
                    })),
                    new FRLGGrass("ポケモンタワー 5F", 6, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ゴース", 15, 1),
                        ("ゴース", 16, 1),
                        ("ゴース", 17, 1),
                        ("ゴース", 13, 1),
                        ("ゴース", 14, 1),
                        ("ゴース", 18, 1),
                        ("ゴースト", 20, 1),
                        ("カラカラ", 15, 1),
                        ("ゴース", 17, 1),
                        ("カラカラ", 17, 1),
                        ("ゴース", 17, 1),
                        ("ゴース", 19, 1),
                    })),
                    new FRLGGrass("ポケモンタワー 6F", 8, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ゴース", 16, 1),
                        ("ゴース", 17, 1),
                        ("ゴース", 18, 1),
                        ("ゴース", 14, 1),
                        ("ゴース", 15, 1),
                        ("ゴース", 19, 1),
                        ("ゴースト", 21, 1),
                        ("カラカラ", 17, 1),
                        ("ゴース", 18, 1),
                        ("カラカラ", 19, 1),
                        ("ゴース", 18, 1),
                        ("ゴースト", 23, 1),
                    })),
                    new FRLGGrass("ポケモンタワー 7F", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ゴース", 16, 1),
                        ("ゴース", 17, 1),
                        ("ゴース", 18, 1),
                        ("ゴース", 15, 1),
                        ("ゴース", 19, 1),
                        ("ゴースト", 23, 1),
                        ("カラカラ", 17, 1),
                        ("カラカラ", 19, 1),
                        ("ゴース", 18, 1),
                        ("ゴースト", 23, 1),
                        ("ゴース", 18, 1),
                        ("ゴースト", 25, 1),
                    })),
                    new FRLGGrass("ふたごじま 1F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ヤドン", 27, 1),
                        ("ヤドン", 29, 1),
                        ("ヤドン", 31, 1),
                        ("ズバット", 22, 1),
                        ("ズバット", 22, 1),
                        ("ズバット", 24, 1),
                        ("ゴルバット", 26, 1),
                        ("ゴルバット", 28, 1),
                        ("ヤドン", 33, 1),
                        ("ズバット", 26, 1),
                        ("ヤドン", 26, 1),
                        ("ゴルバット", 30, 1),
                    })),
                    new FRLGGrass("ふたごじま B1F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ヤドン", 29, 1),
                        ("ヤドン", 31, 1),
                        ("パウワウ", 28, 1),
                        ("ズバット", 22, 1),
                        ("ズバット", 22, 1),
                        ("ズバット", 24, 1),
                        ("ゴルバット", 26, 1),
                        ("ゴルバット", 28, 1),
                        ("ヤドラン", 33, 1),
                        ("ズバット", 26, 1),
                        ("ヤドラン", 35, 1),
                        ("ゴルバット", 30, 1),
                    })),
                    new FRLGGrass("ふたごじま B2F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ヤドン", 30, 1),
                        ("ヤドン", 32, 1),
                        ("パウワウ", 30, 1),
                        ("パウワウ", 32, 1),
                        ("ズバット", 22, 1),
                        ("ズバット", 24, 1),
                        ("ゴルバット", 26, 1),
                        ("ヤドラン", 34, 1),
                        ("ヤドラン", 32, 1),
                        ("ゴルバット", 28, 1),
                        ("ヤドラン", 32, 1),
                        ("ゴルバット", 30, 1),
                    })),
                    new FRLGGrass("ふたごじま B3F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("パウワウ", 30, 1),
                        ("パウワウ", 32, 1),
                        ("ヤドン", 32, 1),
                        ("ヤドン", 30, 1),
                        ("ヤドラン", 32, 1),
                        ("ズバット", 24, 1),
                        ("ゴルバット", 26, 1),
                        ("ヤドラン", 34, 1),
                        ("ジュゴン", 32, 1),
                        ("ゴルバット", 28, 1),
                        ("ジュゴン", 34, 1),
                        ("ゴルバット", 30, 1),
                    })),
                    new FRLGGrass("ふたごじま B4F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("パウワウ", 30, 1),
                        ("パウワウ", 32, 1),
                        ("ヤドン", 32, 1),
                        ("パウワウ", 34, 1),
                        ("ヤドラン", 32, 1),
                        ("ゴルバット", 26, 1),
                        ("ジュゴン", 34, 1),
                        ("ヤドラン", 34, 1),
                        ("ジュゴン", 36, 1),
                        ("ゴルバット", 28, 1),
                        ("ジュゴン", 36, 1),
                        ("ゴルバット", 30, 1),
                    })),
                    new FRLGGrass("ポケモンやしき 1F-3F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ベトベター", 28, 1),
                        ("ラッタ", 32, 1),
                        ("ベトベター", 30, 1),
                        ("ラッタ", 36, 1),
                        ("ロコン", 30, 1),
                        ("コラッタ", 28, 1),
                        ("ドガース", 28, 1),
                        ("ベトベトン", 32, 1),
                        ("ロコン", 32, 1),
                        ("コラッタ", 26, 1),
                        ("ロコン", 32, 1),
                        ("コラッタ", 26, 1),
                    })),
                    new FRLGGrass("ポケモンやしき B1F", 5, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ベトベター", 28, 1),
                        ("ラッタ", 34, 1),
                        ("ベトベター", 30, 1),
                        ("メタモン", 30, 1),
                        ("ロコン", 30, 1),
                        ("ラッタ", 38, 1),
                        ("ドガース", 28, 1),
                        ("ベトベトン", 34, 1),
                        ("ロコン", 32, 1),
                        ("コラッタ", 26, 1),
                        ("ロコン", 32, 1),
                        ("コラッタ", 26, 1),
                    })),
                    new FRLGGrass("チャンピオンロード 1F/3F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ワンリキー", 32, 1),
                        ("イシツブテ", 32, 1),
                        ("イワーク", 40, 1),
                        ("イワーク", 43, 1),
                        ("イワーク", 46, 1),
                        ("ズバット", 32, 1),
                        ("サンドパン", 44, 1),
                        ("ゴルバット", 44, 1),
                        ("ガラガラ", 44, 1),
                        ("ゴーリキー", 44, 1),
                        ("ゴーリキー", 46, 1),
                        ("ガラガラ", 46, 1),
                    })),
                    new FRLGGrass("チャンピオンロード 2F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ワンリキー", 34, 1),
                        ("イシツブテ", 34, 1),
                        ("オコリザル", 42, 1),
                        ("イワーク", 45, 1),
                        ("イワーク", 48, 1),
                        ("ズバット", 34, 1),
                        ("サンドパン", 46, 1),
                        ("ゴルバット", 46, 1),
                        ("ガラガラ", 46, 1),
                        ("ゴーリキー", 46, 1),
                        ("ゴーリキー", 48, 1),
                        ("ガラガラ", 48, 1),
                    })),
                    new FRLGGrass("ハナダのどうくつ 1F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("レアコイル", 49, 1),
                        ("パラセクト", 49, 1),
                        ("ゴルバット", 46, 1),
                        ("ゴーリキー", 46, 1),
                        ("オコリザル", 52, 1),
                        ("メタモン", 52, 1),
                        ("マルマイン", 58, 1),
                        ("パラセクト", 58, 1),
                        ("ゴルバット", 55, 1),
                        ("ソーナンス", 55, 1),
                        ("オコリザル", 61, 1),
                        ("メタモン", 61, 1),
                    })),
                    new FRLGGrass("ハナダのどうくつ 2F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ゴルバット", 49, 1),
                        ("ゴーリキー", 49, 1),
                        ("レアコイル", 52, 1),
                        ("パラセクト", 52, 1),
                        ("ユンゲラー", 55, 1),
                        ("メタモン", 55, 1),
                        ("ゴルバット", 58, 1),
                        ("ソーナンス", 58, 1),
                        ("マルマイン", 61, 1),
                        ("パラセクト", 61, 1),
                        ("ユンゲラー", 64, 1),
                        ("メタモン", 64, 1),
                    })),
                    new FRLGGrass("ハナダのどうくつ B1F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ユンゲラー", 58, 1),
                        ("メタモン", 58, 1),
                        ("レアコイル", 55, 1),
                        ("パラセクト", 55, 1),
                        ("ゴルバット", 52, 1),
                        ("ゴーリキー", 52, 1),
                        ("ユンゲラー", 67, 1),
                        ("メタモン", 67, 1),
                        ("マルマイン", 64, 1),
                        ("パラセクト", 64, 1),
                        ("ゴルバット", 61, 1),
                        ("ソーナンス", 61, 1),
                    })),
                    new FRLGGrass("サファリゾーン 中央エリア", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("サイホーン", 25, 1),
                        ("ニドラン♀", 22, 1),
                        ("タマタマ", 24, 1),
                        ("タマタマ", 25, 1),
                        ("コンパン", 22, 1),
                        ("ニドリーナ", 31, 1),
                        ("ニドリーノ", 31, 1),
                        ("パラセクト", 30, 1),
                        ("コンパン", 22, 1),
                        ("カイロス", 23, 1),
                        ("コンパン", 22, 1),
                        ("ラッキー", 23, 1),
                    })),
                    new FRLGGrass("サファリゾーン 東エリア", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ニドラン♀", 24, 1),
                        ("ドードー", 26, 1),
                        ("タマタマ", 23, 1),
                        ("タマタマ", 25, 1),
                        ("パラス", 22, 1),
                        ("ニドリーナ", 33, 1),
                        ("ニドラン♂", 24, 1),
                        ("パラセクト", 25, 1),
                        ("パラス", 22, 1),
                        ("ガルーラ", 25, 1),
                        ("パラス", 22, 1),
                        ("カイロス", 28, 1),
                    })),
                    new FRLGGrass("サファリゾーン 北エリア", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("サイホーン", 26, 1),
                        ("ニドラン♀", 30, 1),
                        ("タマタマ", 25, 1),
                        ("タマタマ", 27, 1),
                        ("パラス", 23, 1),
                        ("ニドリーナ", 30, 1),
                        ("ニドリーノ", 30, 1),
                        ("モルフォン", 32, 1),
                        ("パラス", 23, 1),
                        ("ラッキー", 26, 1),
                        ("パラス", 23, 1),
                        ("ケンタロス", 28, 1),
                    })),
                    new FRLGGrass("サファリゾーン 西エリア", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ドードー", 26, 1),
                        ("ニドラン♀", 22, 1),
                        ("タマタマ", 25, 1),
                        ("タマタマ", 27, 1),
                        ("コンパン", 23, 1),
                        ("ニドリーナ", 30, 1),
                        ("ニドラン♂", 30, 1),
                        ("モルフォン", 32, 1),
                        ("コンパン", 23, 1),
                        ("ケンタロス", 25, 1),
                        ("コンパン", 23, 1),
                        ("ガルーラ", 28, 1),
                    })),
                    new FRLGGrass("たからのはま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("オニスズメ", 32, 1),
                        ("モンジャラ", 33, 1),
                        ("オニスズメ", 31, 1),
                        ("モンジャラ", 35, 1),
                        ("オニドリル", 36, 1),
                        ("ニャース", 31, 1),
                        ("オニドリル", 38, 1),
                        ("ヤドン", 31, 1),
                        ("オニドリル", 40, 1),
                        ("ペルシアン", 37, 1),
                        ("オニドリル", 40, 1),
                        ("ペルシアン", 40, 1),
                    })),
                    new FRLGGrass("ほてりのみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("オニスズメ", 32, 1),
                        ("ポニータ", 34, 1),
                        ("オニドリル", 36, 1),
                        ("ポニータ", 31, 1),
                        ("イシツブテ", 31, 1),
                        ("ニャース", 31, 1),
                        ("オニスズメ", 30, 1),
                        ("ヤドン", 34, 1),
                        ("ギャロップ", 37, 1),
                        ("ペルシアン", 37, 1),
                        ("ギャロップ", 40, 1),
                        ("ペルシアン", 40, 1),
                    })),
                    new FRLGGrass("ともしびやま 外", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ポニータ", 30, 1),
                        ("オニドリル", 38, 1),
                        ("ポニータ", 33, 1),
                        ("オニスズメ", 32, 1),
                        ("ワンリキー", 35, 1),
                        ("イシツブテ", 33, 1),
                        ("ポニータ", 36, 1),
                        ("オニドリル", 40, 1),
                        ("ブーバー", 38, 1),
                        ("ギャロップ", 39, 1),
                        ("ブーバー", 40, 1),
                        ("ギャロップ", 42, 1),
                    })),
                    new FRLGGrass("ともしびやま 洞窟(左)", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("イシツブテ", 33, 1),
                        ("ワンリキー", 35, 1),
                        ("イシツブテ", 29, 1),
                        ("イシツブテ", 31, 1),
                        ("ワンリキー", 31, 1),
                        ("ワンリキー", 33, 1),
                        ("イシツブテ", 35, 1),
                        ("ワンリキー", 37, 1),
                        ("イシツブテ", 37, 1),
                        ("ワンリキー", 39, 1),
                        ("イシツブテ", 37, 1),
                        ("ワンリキー", 39, 1),
                    })),
                    new FRLGGrass("ともしびやま 洞窟(左) 火口", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("イシツブテ", 34, 1),
                        ("ワンリキー", 36, 1),
                        ("イシツブテ", 30, 1),
                        ("イシツブテ", 32, 1),
                        ("ワンリキー", 32, 1),
                        ("ワンリキー", 34, 1),
                        ("ゴーリキー", 38, 1),
                        ("ゴーリキー", 38, 1),
                        ("ゴーリキー", 40, 1),
                        ("ゴーリキー", 40, 1),
                        ("ゴーリキー", 40, 1),
                        ("ゴーリキー", 40, 1),
                    })),
                    new FRLGGrass("ともしびやま 洞窟(右) 1F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("イシツブテ", 36, 1),
                        ("ワンリキー", 38, 1),
                        ("イシツブテ", 32, 1),
                        ("イシツブテ", 34, 1),
                        ("ワンリキー", 34, 1),
                        ("ワンリキー", 36, 1),
                        ("イシツブテ", 38, 1),
                        ("ゴーリキー", 40, 1),
                        ("イシツブテ", 40, 1),
                        ("ゴーリキー", 42, 1),
                        ("イシツブテ", 40, 1),
                        ("ゴーリキー", 42, 1),
                    })),
                    new FRLGGrass("ともしびやま 洞窟(右) B1F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("イシツブテ", 38, 1),
                        ("イシツブテ", 36, 1),
                        ("イシツブテ", 34, 1),
                        ("イシツブテ", 40, 1),
                        ("マグマッグ", 24, 1),
                        ("マグマッグ", 26, 1),
                        ("イシツブテ", 42, 1),
                        ("マグマッグ", 28, 1),
                        ("イシツブテ", 42, 1),
                        ("マグマッグ", 30, 1),
                        ("イシツブテ", 42, 1),
                        ("マグマッグ", 30, 1),
                    })),
                    new FRLGGrass("ともしびやま 洞窟(右) B2F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("イシツブテ", 40, 1),
                        ("マグマッグ", 26, 1),
                        ("イシツブテ", 42, 1),
                        ("マグマッグ", 24, 1),
                        ("マグマッグ", 28, 1),
                        ("マグマッグ", 30, 1),
                        ("イシツブテ", 44, 1),
                        ("マグマッグ", 32, 1),
                        ("イシツブテ", 44, 1),
                        ("マグマッグ", 22, 1),
                        ("イシツブテ", 44, 1),
                        ("マグマッグ", 22, 1),
                    })),
                    new FRLGGrass("ともしびやま 洞窟(右) B3F", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("マグマッグ", 26, 1),
                        ("マグマッグ", 28, 1),
                        ("マグマッグ", 30, 1),
                        ("マグマッグ", 32, 1),
                        ("マグマッグ", 24, 1),
                        ("マグマッグ", 22, 1),
                        ("マグマッグ", 20, 1),
                        ("マグマッグ", 34, 1),
                        ("マグマッグ", 36, 1),
                        ("マグマッグ", 18, 1),
                        ("マグマッグ", 36, 1),
                        ("マグマッグ", 18, 1),
                    })),
                    new FRLGGrass("きわのみさき", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("オニスズメ", 31, 1),
                        ("マダツボミ", 30, 1),
                        ("マダツボミ", 32, 1),
                        ("ウツドン", 36, 1),
                        ("オニドリル", 36, 1),
                        ("ニャース", 31, 1),
                        ("ウツドン", 38, 1),
                        ("ヤドン", 31, 1),
                        ("ヤドラン", 37, 1),
                        ("ペルシアン", 37, 1),
                        ("ヤドラン", 40, 1),
                        ("ペルシアン", 40, 1),
                    })),
                    new FRLGGrass("きずなばし", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ポッポ", 32, 1),
                        ("マダツボミ", 31, 1),
                        ("ポッポ", 29, 1),
                        ("ウツドン", 36, 1),
                        ("ピジョン", 34, 1),
                        ("ニャース", 31, 1),
                        ("コンパン", 34, 1),
                        ("ヤドン", 31, 1),
                        ("ピジョン", 37, 1),
                        ("ペルシアン", 37, 1),
                        ("ピジョン", 40, 1),
                        ("ペルシアン", 40, 1),
                    })),
                    new FRLGGrass("きのみのもり", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ピジョン", 37, 1),
                        ("ウツドン", 35, 1),
                        ("ポッポ", 32, 1),
                        ("マダツボミ", 30, 1),
                        ("コンパン", 34, 1),
                        ("スリープ", 34, 1),
                        ("タマタマ", 35, 1),
                        ("ヤドン", 31, 1),
                        ("モルフォン", 37, 1),
                        ("スリーパー", 37, 1),
                        ("モルフォン", 40, 1),
                        ("スリーパー", 40, 1),
                    })),
                    new FRLGGrass("いてだきのどうくつ 入口/奥", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("パウワウ", 43, 1),
                        ("ゴルバット", 45, 1),
                        ("パウワウ", 45, 1),
                        ("パウワウ", 47, 1),
                        ("ズバット", 40, 1),
                        ("ジュゴン", 49, 1),
                        ("ジュゴン", 51, 1),
                        ("ヤドン", 41, 1),
                        ("ゴルバット", 48, 1),
                        ("ジュゴン", 53, 1),
                        ("ゴルバット", 48, 1),
                        ("ジュゴン", 53, 1),
                    })),
                    new FRLGGrass("いてだきのどうくつ 中央/地下", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ウリムー", 25, 1),
                        ("ゴルバット", 45, 1),
                        ("パウワウ", 45, 1),
                        ("ウリムー", 27, 1),
                        ("ズバット", 40, 1),
                        ("ウリムー", 29, 1),
                        ("ニューラ", 30, 1),
                        ("ウリムー", 31, 1),
                        ("ゴルバット", 48, 1),
                        ("ウリムー", 23, 1),
                        ("ゴルバット", 48, 1),
                        ("ウリムー", 23, 1),
                    })),
                    new FRLGGrass("おもいでのとう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ハネッコ", 10, 1),
                        ("ハネッコ", 12, 1),
                        ("ハネッコ", 8, 1),
                        ("ハネッコ", 14, 1),
                        ("ハネッコ", 10, 1),
                        ("ハネッコ", 12, 1),
                        ("ハネッコ", 16, 1),
                        ("ハネッコ", 6, 1),
                        ("ハネッコ", 8, 1),
                        ("ハネッコ", 14, 1),
                        ("ハネッコ", 8, 1),
                        ("ハネッコ", 14, 1),
                    })),
                    new FRLGGrass("かえらずのあな 部屋1", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ゴース", 40, 1),
                        ("ズバット", 37, 1),
                        ("ゴースト", 44, 1),
                        ("ゴースト", 46, 1),
                        ("ゴルバット", 41, 1),
                        ("ゴルバット", 43, 1),
                        ("ゴース", 38, 1),
                        ("ゴースト", 48, 1),
                        ("ゴースト", 50, 1),
                        ("ムウマ", 22, 1),
                        ("ゴースト", 52, 1),
                        ("ムウマ", 22, 1),
                    })),
                    new FRLGGrass("かえらずのあな 部屋2", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ゴース", 40, 1),
                        ("ズバット", 37, 1),
                        ("ゴースト", 44, 1),
                        ("ゴースト", 46, 1),
                        ("ゴルバット", 41, 1),
                        ("ゴルバット", 43, 1),
                        ("ゴース", 38, 1),
                        ("ゴースト", 48, 1),
                        ("ゴースト", 50, 1),
                        ("ムウマ", 22, 1),
                        ("ゴースト", 52, 1),
                        ("ムウマ", 22, 1),
                    })),
                    new FRLGGrass("かえらずのあな 部屋3", 3, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ゴース", 40, 1),
                        ("ズバット", 37, 1),
                        ("ゴースト", 44, 1),
                        ("ゴースト", 46, 1),
                        ("ゴルバット", 41, 1),
                        ("ゴルバット", 43, 1),
                        ("ゴース", 38, 1),
                        ("ゴースト", 48, 1),
                        ("ゴースト", 50, 1),
                        ("ムウマ", 22, 1),
                        ("ゴースト", 52, 1),
                        ("ムウマ", 22, 1),
                    })),
                    new FRLGGrass("かえらずのあな 部屋4", 4, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ゴース", 40, 1),
                        ("ズバット", 37, 1),
                        ("ゴースト", 44, 1),
                        ("ゴースト", 46, 1),
                        ("ゴルバット", 41, 1),
                        ("ゴルバット", 43, 1),
                        ("ゴース", 38, 1),
                        ("ゴースト", 48, 1),
                        ("ゴースト", 50, 1),
                        ("ムウマ", 22, 1),
                        ("ゴースト", 52, 1),
                        ("ムウマ", 22, 1),
                    })),
                    new FRLGGrass("かえらずのあな 部屋5", 5, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ゴース", 40, 1),
                        ("ズバット", 37, 1),
                        ("ゴースト", 44, 1),
                        ("ゴースト", 46, 1),
                        ("ゴルバット", 41, 1),
                        ("ゴルバット", 43, 1),
                        ("ゴース", 38, 1),
                        ("ゴースト", 48, 1),
                        ("ゴースト", 50, 1),
                        ("ムウマ", 22, 1),
                        ("ゴースト", 52, 1),
                        ("ムウマ", 22, 1),
                    })),
                    new FRLGGrass("かえらずのあな 部屋6", 6, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ゴース", 40, 1),
                        ("ズバット", 37, 1),
                        ("ゴースト", 44, 1),
                        ("ゴースト", 46, 1),
                        ("ゴルバット", 41, 1),
                        ("ゴルバット", 43, 1),
                        ("ゴース", 38, 1),
                        ("ゴースト", 48, 1),
                        ("ゴースト", 50, 1),
                        ("ムウマ", 22, 1),
                        ("ゴースト", 52, 1),
                        ("ムウマ", 22, 1),
                    })),
                    new FRLGGrass("かえらずのあな 部屋7", 7, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ゴース", 40, 1),
                        ("ズバット", 37, 1),
                        ("ゴースト", 44, 1),
                        ("ゴースト", 46, 1),
                        ("ゴルバット", 41, 1),
                        ("ゴルバット", 43, 1),
                        ("ゴース", 38, 1),
                        ("ゴースト", 48, 1),
                        ("ゴースト", 50, 1),
                        ("ムウマ", 22, 1),
                        ("ゴースト", 52, 1),
                        ("ムウマ", 22, 1),
                    })),
                    new FRLGGrass("かえらずのあな 部屋8", 8, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ゴース", 40, 1),
                        ("ズバット", 37, 1),
                        ("ゴースト", 44, 1),
                        ("ゴースト", 46, 1),
                        ("ゴルバット", 41, 1),
                        ("ゴルバット", 43, 1),
                        ("ゴース", 38, 1),
                        ("ゴースト", 48, 1),
                        ("ゴースト", 50, 1),
                        ("ムウマ", 22, 1),
                        ("ゴースト", 52, 1),
                        ("ムウマ", 22, 1),
                    })),
                    new FRLGGrass("かえらずのあな 部屋9", 9, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ゴース", 40, 1),
                        ("ズバット", 37, 1),
                        ("ゴースト", 44, 1),
                        ("ゴースト", 46, 1),
                        ("ゴルバット", 41, 1),
                        ("ゴルバット", 43, 1),
                        ("ゴース", 38, 1),
                        ("ゴースト", 48, 1),
                        ("ゴースト", 50, 1),
                        ("ムウマ", 22, 1),
                        ("ゴースト", 52, 1),
                        ("ムウマ", 22, 1),
                    })),
                    new FRLGGrass("かえらずのあな 最奥", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ゴース", 40, 1),
                        ("ズバット", 37, 1),
                        ("ゴースト", 44, 1),
                        ("ゴースト", 46, 1),
                        ("ゴルバット", 41, 1),
                        ("ゴルバット", 43, 1),
                        ("ゴース", 38, 1),
                        ("ゴースト", 48, 1),
                        ("ゴースト", 50, 1),
                        ("ムウマ", 22, 1),
                        ("ゴースト", 52, 1),
                        ("ムウマ", 22, 1),
                    })),
                    new FRLGGrass("かえらずのあな 道具部屋", 5, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ゴース", 40, 1),
                        ("ズバット", 37, 1),
                        ("ゴースト", 44, 1),
                        ("ゴースト", 46, 1),
                        ("ゴルバット", 41, 1),
                        ("ムウマ", 15, 1),
                        ("ムウマ", 20, 1),
                        ("ゴースト", 48, 1),
                        ("ゴースト", 50, 1),
                        ("ムウマ", 22, 1),
                        ("ゴースト", 52, 1),
                        ("ムウマ", 22, 1),
                    })),
                    new FRLGGrass("みずのさんぽみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("オニスズメ", 44, 1),
                        ("オタチ", 10, 1),
                        ("マダツボミ", 44, 1),
                        ("オニドリル", 48, 1),
                        ("オタチ", 15, 1),
                        ("ニャース", 41, 1),
                        ("ウツドン", 48, 1),
                        ("ヤドン", 41, 1),
                        ("オニドリル", 50, 1),
                        ("ペルシアン", 47, 1),
                        ("オニドリル", 50, 1),
                        ("ペルシアン", 50, 1),
                    })),
                    new FRLGGrass("いせきのたに", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ネイティ", 15, 1),
                        ("オニスズメ", 44, 1),
                        ("ヤンヤンマ", 18, 1),
                        ("マリル", 15, 1),
                        ("オニドリル", 49, 1),
                        ("ニャース", 43, 1),
                        ("ソーナンス", 25, 1),
                        ("ヤドン", 41, 1),
                        ("ネイティ", 20, 1),
                        ("ペルシアン", 49, 1),
                        ("ネイティ", 20, 1),
                        ("ペルシアン", 52, 1),
                    })),
                    new FRLGGrass("しるしのはやし", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("レディバ", 9, 1),
                        ("コクーン", 9, 1),
                        ("レディバ", 14, 1),
                        ("キャタピー", 6, 1),
                        ("ビードル", 6, 1),
                        ("ヘラクロス", 15, 1),
                        ("トランセル", 9, 1),
                        ("ヘラクロス", 20, 1),
                        ("イトマル", 9, 1),
                        ("ヘラクロス", 25, 1),
                        ("イトマル", 14, 1),
                        ("ヘラクロス", 30, 1),
                    })),
                    new FRLGGrass("けいこくいりぐち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("オニスズメ", 44, 1),
                        ("オタチ", 10, 1),
                        ("ゴマゾウ", 10, 1),
                        ("オニドリル", 48, 1),
                        ("オタチ", 15, 1),
                        ("ニャース", 41, 1),
                        ("オニドリル", 50, 1),
                        ("ヤドン", 41, 1),
                        ("ゴマゾウ", 15, 1),
                        ("ペルシアン", 47, 1),
                        ("ゴマゾウ", 15, 1),
                        ("ペルシアン", 50, 1),
                    })),
                    new FRLGGrass("しっぽうけいこく", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("イシツブテ", 46, 1),
                        ("ゴマゾウ", 15, 1),
                        ("カラカラ", 46, 1),
                        ("オニドリル", 50, 1),
                        ("ガラガラ", 52, 1),
                        ("ニャース", 43, 1),
                        ("イワーク", 54, 1),
                        ("オニドリル", 50, 1),
                        ("ヨーギラス", 15, 1),
                        ("ペルシアン", 49, 1),
                        ("ヨーギラス", 20, 1),
                        ("ペルシアン", 52, 1),
                    })),
                    new FRLGGrass("へんげのどうくつ", 5, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ズバット", 10, 1),
                        ("ズバット", 12, 1),
                        ("ズバット", 8, 1),
                        ("ズバット", 14, 1),
                        ("ズバット", 10, 1),
                        ("ズバット", 12, 1),
                        ("ズバット", 16, 1),
                        ("ズバット", 6, 1),
                        ("ズバット", 8, 1),
                        ("ズバット", 14, 1),
                        ("ズバット", 8, 1),
                        ("ズバット", 14, 1),
                    })),
                    new FRLGTanobyRuin("イレスのせきしつ", 7, UnownSlot.CreateTable(new (string, uint)[]
                    {
                        ("A", 25), ("A", 25), ("A", 25), ("A", 25),
                        ("A", 25), ("A", 25), ("A", 25), ("A", 25),
                        ("A", 25), ("A", 25), ("A", 25), ("?", 25),
                    })),
                    new FRLGTanobyRuin("ナザンのせきしつ", 7, UnownSlot.CreateTable(new (string, uint)[]
                    {
                        ("C", 25), ("C", 25), ("C", 25), ("D", 25),
                        ("D", 25), ("D", 25), ("H", 25), ("H", 25),
                        ("H", 25), ("U", 25), ("U", 25), ("O", 25),
                    })),
                    new FRLGTanobyRuin("ユゴのせきしつ", 7, UnownSlot.CreateTable(new (string, uint)[]
                    {
                        ("N", 25), ("N", 25), ("N", 25), ("N", 25),
                        ("S", 25), ("S", 25), ("S", 25), ("S", 25),
                        ("I", 25), ("I", 25), ("E", 25), ("E", 25),
                    })),
                    new FRLGTanobyRuin("アレボカのせきしつ", 7, UnownSlot.CreateTable(new (string, uint)[]
                    {
                        ("P", 25), ("P", 25), ("L", 25), ("L", 25),
                        ("J", 25), ("J", 25), ("R", 25), ("R", 25),
                        ("R", 25), ("Q", 25), ("Q", 25), ("Q", 25),
                    })),
                    new FRLGTanobyRuin("コトーのせきしつ", 7, UnownSlot.CreateTable(new (string, uint)[]
                    {
                        ("Y", 25), ("Y", 25), ("T", 25), ("T", 25),
                        ("G", 25), ("G", 25), ("G", 25), ("F", 25),
                        ("F", 25), ("F", 25), ("K", 25), ("K", 25),
                    })),
                    new FRLGTanobyRuin("アヌザのせきしつ", 7, UnownSlot.CreateTable(new (string, uint)[]
                    {
                        ("V", 25), ("V", 25), ("V", 25), ("W", 25),
                        ("W", 25), ("W", 25), ("X", 25), ("X", 25),
                        ("M", 25), ("M", 25), ("B", 25), ("B", 25),
                    })),
                    new FRLGTanobyRuin("オリフのせきしつ", 7, UnownSlot.CreateTable(new (string, uint)[]
                    {
                        ("Z", 25), ("Z", 25), ("Z", 25), ("Z", 25),
                        ("Z", 25), ("Z", 25), ("Z", 25), ("Z", 25),
                        ("Z", 25), ("Z", 25), ("Z", 25), ("!", 25),
                    })),
                };
            }
        }

        public static class Surf
        {
            public static GBAMap[] SelectMap(string mapNameKeyWord = "")
                => tables.Where(_ => _.MapName.Contains(mapNameKeyWord)).ToArray();

            private static readonly GBAMap[] tables;
            static Surf()
            {
                tables = new GBAMap[]
                {
                    new FRLGSurf("4ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 6),
                        ("メノクラゲ", 10, 11),
                        ("メノクラゲ", 20, 11),
                        ("メノクラゲ", 30, 6),
                        ("メノクラゲ", 35, 6),
                    })),
                    new FRLGSurf("6ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ヤドン", 20, 6),
                        ("ヤドン", 20, 6),
                        ("ヤドン", 25, 6),
                        ("ヤドン", 30, 6),
                        ("ヤドン", 35, 6),
                    })),
                    new FRLGSurf("10ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 6),
                        ("メノクラゲ", 10, 11),
                        ("メノクラゲ", 20, 11),
                        ("メノクラゲ", 30, 6),
                        ("メノクラゲ", 35, 6),
                    })),
                    new FRLGSurf("11ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 6),
                        ("メノクラゲ", 10, 11),
                        ("メノクラゲ", 20, 11),
                        ("メノクラゲ", 30, 6),
                        ("メノクラゲ", 35, 6),
                    })),
                    new FRLGSurf("12ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 6),
                        ("メノクラゲ", 10, 11),
                        ("メノクラゲ", 20, 11),
                        ("メノクラゲ", 30, 6),
                        ("メノクラゲ", 35, 6),
                    })),
                    new FRLGSurf("13ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 6),
                        ("メノクラゲ", 10, 11),
                        ("メノクラゲ", 20, 11),
                        ("メノクラゲ", 30, 6),
                        ("メノクラゲ", 35, 6),
                    })),
                    new FRLGSurf("19ばんすいどう", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 6),
                        ("メノクラゲ", 10, 11),
                        ("メノクラゲ", 20, 11),
                        ("メノクラゲ", 30, 6),
                        ("メノクラゲ", 35, 6),
                    })),
                    new FRLGSurf("20ばんすいどう", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 6),
                        ("メノクラゲ", 10, 11),
                        ("メノクラゲ", 20, 11),
                        ("メノクラゲ", 30, 6),
                        ("メノクラゲ", 35, 6),
                    })),
                    new FRLGSurf("21ばんすいどう", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 6),
                        ("メノクラゲ", 10, 11),
                        ("メノクラゲ", 20, 11),
                        ("メノクラゲ", 30, 6),
                        ("メノクラゲ", 35, 6),
                    })),
                    new FRLGSurf("22ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ヤドン", 20, 6),
                        ("ヤドン", 20, 6),
                        ("ヤドン", 25, 6),
                        ("ヤドン", 30, 6),
                        ("ヤドン", 35, 6),
                    })),
                    new FRLGSurf("23ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ヤドン", 20, 6),
                        ("ヤドン", 20, 6),
                        ("ヤドン", 25, 6),
                        ("ヤドン", 30, 6),
                        ("ヤドン", 35, 6),
                    })),
                    new FRLGSurf("24ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 6),
                        ("メノクラゲ", 10, 11),
                        ("メノクラゲ", 20, 11),
                        ("メノクラゲ", 30, 6),
                        ("メノクラゲ", 35, 6),
                    })),
                    new FRLGSurf("25ばんどうろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ヤドン", 20, 6),
                        ("ヤドン", 20, 6),
                        ("ヤドン", 25, 6),
                        ("ヤドン", 30, 6),
                        ("ヤドン", 35, 6),
                    })),
                    new FRLGSurf("1のしま", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 16),
                        ("メノクラゲ", 20, 16),
                        ("メノクラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                    })),
                    new FRLGSurf("4のしま", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("マリル", 5, 11),
                        ("ヤドン", 5, 31),
                        ("マリル", 15, 11),
                        ("マリル", 15, 11),
                        ("マリル", 15, 11),
                    })),
                    new FRLGSurf("5のしま", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 31),
                        ("ハネッコ", 5, 11),
                        ("メノクラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                    })),
                    new FRLGSurf("5のしま あきち", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 31),
                        ("ハネッコ", 5, 11),
                        ("メノクラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                    })),
                    new FRLGSurf("マサラタウン", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 6),
                        ("メノクラゲ", 10, 11),
                        ("メノクラゲ", 20, 11),
                        ("メノクラゲ", 30, 6),
                        ("メノクラゲ", 35, 6),
                    })),
                    new FRLGSurf("トキワシティ", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ヤドン", 20, 6),
                        ("ヤドン", 20, 6),
                        ("ヤドン", 25, 6),
                        ("ヤドン", 30, 6),
                        ("ヤドン", 35, 6),
                    })),
                    new FRLGSurf("ハナダシティ", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 6),
                        ("メノクラゲ", 10, 11),
                        ("メノクラゲ", 20, 11),
                        ("メノクラゲ", 30, 6),
                        ("メノクラゲ", 35, 6),
                    })),
                    new FRLGSurf("クチバシティ", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 6),
                        ("メノクラゲ", 10, 11),
                        ("メノクラゲ", 20, 11),
                        ("メノクラゲ", 30, 6),
                        ("メノクラゲ", 35, 6),
                    })),
                    new FRLGSurf("タマムシシティ", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ヤドン", 5, 6),
                        ("ヤドン", 10, 11),
                        ("ヤドン", 20, 11),
                        ("ヤドン", 30, 11),
                        ("ドガース", 30, 11),
                    })),
                    new FRLGSurf("セキチクシティ", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ヤドン", 20, 6),
                        ("ヤドン", 20, 6),
                        ("ヤドン", 25, 6),
                        ("ヤドン", 30, 6),
                        ("ヤドン", 35, 6),
                    })),
                    new FRLGSurf("グレンじま", 1, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 6),
                        ("メノクラゲ", 10, 11),
                        ("メノクラゲ", 20, 11),
                        ("メノクラゲ", 30, 6),
                        ("メノクラゲ", 35, 6),
                    })),
                    new FRLGSurf("サファリゾーン", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ヤドン", 20, 6),
                        ("ヤドン", 20, 6),
                        ("ヤドン", 25, 6),
                        ("ヤドン", 30, 6),
                        ("ヤドン", 35, 6),
                    })),
                    new FRLGSurf("ふたごじま", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("パウワウ", 25, 11),
                        ("クラブ", 25, 6),
                        ("ジュゴン", 35, 6),
                        ("ヤドン", 30, 11),
                        ("ヤドラン", 35, 6),
                    })),
                    new FRLGSurf("ハナダのどうくつ 1F", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ヤドン", 30, 11),
                        ("ヤドラン", 40, 11),
                        ("ヤドラン", 45, 11),
                        ("ヤドン", 40, 11),
                        ("ヤドン", 40, 11),
                    })),
                    new FRLGSurf("ハナダのどうくつ B1F", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ヤドン", 40, 11),
                        ("ヤドラン", 50, 11),
                        ("ヤドラン", 55, 11),
                        ("ヤドン", 50, 11),
                        ("ヤドン", 50, 11),
                    })),
                    new FRLGSurf("ほてりのみち", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 16),
                        ("メノクラゲ", 20, 16),
                        ("メノクラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                    })),
                    new FRLGSurf("たからのはま", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 16),
                        ("メノクラゲ", 20, 16),
                        ("メノクラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                    })),
                    new FRLGSurf("きわのみさき", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ヤドン", 5, 16),
                        ("ヤドン", 20, 16),
                        ("ヤドン", 35, 6),
                        ("ヤドラン", 35, 6),
                        ("ヤドラン", 35, 6),
                    })),
                    new FRLGSurf("きずなばし", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 16),
                        ("メノクラゲ", 20, 16),
                        ("メノクラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                    })),
                    new FRLGSurf("きのみのもり", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("ヤドン", 5, 16),
                        ("ヤドン", 20, 16),
                        ("ヤドン", 35, 6),
                        ("ヤドラン", 35, 6),
                        ("ヤドラン", 35, 6),
                    })),
                    new FRLGSurf("いてだきのどうくつ 入口", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("パウワウ", 5, 31),
                        ("ヤドン", 5, 31),
                        ("ジュゴン", 35, 6),
                        ("マリル", 5, 11),
                        ("マリル", 5, 11),
                    })),
                    new FRLGSurf("いてだきのどうくつ 奥", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 16),
                        ("メノクラゲ", 20, 16),
                        ("メノクラゲ", 35, 11),
                        ("ドククラゲ", 35, 11),
                        ("ラプラス", 30, 16),
                    })),
                    new FRLGSurf("おもいでのとう", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 31),
                        ("ハネッコ", 5, 11),
                        ("メノクラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                    })),
                    new FRLGSurf("ゴージャスリゾート", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 31),
                        ("ハネッコ", 5, 11),
                        ("メノクラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                    })),
                    new FRLGSurf("みずのめいろ", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 31),
                        ("ハネッコ", 5, 11),
                        ("メノクラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                    })),
                    new FRLGSurf("みずのさんぽみち", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 16),
                        ("メノクラゲ", 20, 16),
                        ("メノクラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                    })),
                    new FRLGSurf("いせきのたに", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("マリル", 5, 16),
                        ("マリル", 10, 11),
                        ("マリル", 15, 11),
                        ("マリル", 20, 6),
                        ("マリル", 20, 6),
                    })),
                    new FRLGSurf("みどりのさんぽみち", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 16),
                        ("メノクラゲ", 20, 16),
                        ("メノクラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                    })),
                    new FRLGSurf("はずれのしま", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 16),
                        ("メノクラゲ", 20, 16),
                        ("メノクラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                    })),
                    new FRLGSurf("トレーナータワー", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 16),
                        ("メノクラゲ", 20, 16),
                        ("マンタイン", 35, 6),
                        ("ドククラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                    })),
                    new FRLGSurf("アスカナいせき", 2, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("メノクラゲ", 5, 16),
                        ("メノクラゲ", 20, 16),
                        ("マンタイン", 35, 6),
                        ("ドククラゲ", 35, 6),
                        ("ドククラゲ", 35, 6),
                    })),
                };
            }
        }

        public static class OldRod
        {
            public static GBAMap[] SelectMap(string mapNameKeyWord = "")
                => tables.Where(_ => _.MapName.Contains(mapNameKeyWord)).ToArray();

            private static readonly GBAMap[] tables;
            static OldRod()
            {
                tables = new GBAMap[]
                {
                    new FRLGOldRod("4ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("6ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("10ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("11ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("12ばんどうろ", 60, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("13ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("19ばんすいどう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("20ばんすいどう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("21ばんすいどう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("22ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("23ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("24ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("25ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("1のしま", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("4のしま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("5のしま", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("5のしま あきち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("マサラタウン", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 6),
                        ("コイキング", 5, 6),
                    })),
                    new FRLGOldRod("トキワシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("ハナダシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("クチバシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("タマムシシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("セキチクシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("グレンじま", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("サファリゾーン", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("ふたごじま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("ハナダのどうくつ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("ほてりのみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("たからのはま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("きわのみさき", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("きずなばし", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("きのみのもり", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("いてだきのどうくつ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("おもいでのとう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("ゴージャスリゾート", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("みずのめいろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("みずのさんぽみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("いせきのたに", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("みどりのさんぽみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("はずれのしま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("トレーナータワー", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),
                    new FRLGOldRod("アスカナいせき", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                    {
                        ("コイキング", 5, 1),
                        ("コイキング", 5, 1),
                    })),

                };
            }
        }

        public static class GoodRod
        {
            public static GBAMap[] SelectMap(string mapNameKeyWord = "")
                => tables.Where(_ => _.MapName.Contains(mapNameKeyWord)).ToArray();

            private static readonly GBAMap[] tables;
            static GoodRod()
            {
                tables = new GBAMap[]
                {
                new FRLGGoodRod("4ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("6ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("10ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("11ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("12ばんどうろ", 60, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("13ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("19ばんすいどう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("20ばんすいどう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("21ばんすいどう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("22ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("23ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("24ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("25ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("1のしま", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("4のしま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("5のしま", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("5のしま あきち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("マサラタウン", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("トキワシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("ハナダシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("クチバシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("タマムシシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 5, 11),
                    ("コイキング", 5, 11),
                    ("コイキング", 5, 11),
                })),
                new FRLGGoodRod("セキチクシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("トサキント", 5, 11),
                    ("コイキング", 5, 11),
                    ("ニョロモ", 5, 11),
                })),
                new FRLGGoodRod("グレンじま", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("サファリゾーン", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("トサキント", 5, 11),
                    ("コイキング", 5, 11),
                    ("ニョロモ", 5, 11),
                })),
                new FRLGGoodRod("ふたごじま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("タッツー", 5, 11),
                })),
                new FRLGGoodRod("ハナダのどうくつ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("ほてりのみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("たからのはま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("きわのみさき", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("きずなばし", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("きのみのもり", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("トサキント", 5, 11),
                    ("コイキング", 5, 11),
                    ("ニョロモ", 5, 11),
                })),
                new FRLGGoodRod("いてだきのどうくつ 入口", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("いてだきのどうくつ 奥", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("おもいでのとう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("ゴージャスリゾート", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("みずのめいろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("みずのさんぽみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("いせきのたに", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 5, 11),
                    ("コイキング", 5, 11),
                    ("トサキント", 5, 11),
                })),
                new FRLGGoodRod("みどりのさんぽみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("はずれのしま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("トレーナータワー", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),
                new FRLGGoodRod("アスカナいせき", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 5, 11),
                    ("コイキング", 5, 11),
                    ("クラブ", 5, 11),
                })),

                };
            }
        }

        public static class SuperRod
        {
            public static GBAMap[] SelectMap(string mapNameKeyWord = "")
                => tables.Where(_ => _.MapName.Contains(mapNameKeyWord)).ToArray();

            private static readonly GBAMap[] tables;
            static SuperRod()
            {
                tables = new GBAMap[]
                {
                new FRLGSuperRod("4ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("クラブ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("クラブ", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("6ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("ヤドン", 15, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("10ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("クラブ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("クラブ", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("11ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("クラブ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("クラブ", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("12ばんどうろ", 60, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("クラブ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("クラブ", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("13ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("クラブ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("クラブ", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("19ばんすいどう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("クラブ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("20ばんすいどう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("クラブ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("21ばんすいどう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("クラブ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("22ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("ヤドン", 15, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("23ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("ヤドン", 15, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("24ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("クラブ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("クラブ", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("25ばんどうろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("ヤドン", 15, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("1のしま", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("ヒトデマン", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("4のしま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("ヤドン", 15, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("5のしまあきち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("テッポウオ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("5のしま", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("ヒトデマン", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("マサラタウン", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("ヒトデマン", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("トキワシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("ヤドン", 15, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("ハナダシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("クラブ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("クラブ", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("クチバシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("ヒトデマン", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("クラブ", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("タマムシシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("コイキング", 15, 11),
                    ("コイキング", 15, 11),
                    ("コイキング", 15, 11),
                    ("コイキング", 25, 11),
                    ("ベトベター", 30, 11),
                })),
                new FRLGSuperRod("セキチクシティ", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("トサキント", 15, 11),
                    ("アズマオウ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("ヤドン", 15, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("グレンじま", 10, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("ヒトデマン", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("ヤドラン", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("サファリゾーン", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("トサキント", 15, 11),
                    ("アズマオウ", 20, 11),
                    ("ミニリュウ", 15, 11),
                    ("ヤドン", 15, 21),
                    ("ハクリュー", 25, 11),
                })),
                new FRLGSuperRod("ふたごじま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("クラブ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("ヤドン", 15, 11),
                    ("ギャラドス", 25, 11),
                })),
                new FRLGSuperRod("ハナダのどうくつ 1F", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("ヤドン", 15, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("ハナダのどうくつ B1F", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("ヤドン", 15, 11),
                    ("ギャラドス", 25, 11),
                })),
                new FRLGSuperRod("ほてりのみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("クラブ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("たからのはま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("クラブ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("きわのみさき", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("ヤドン", 15, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("きずなばし", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("クラブ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("きのみのもり", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("トサキント", 15, 11),
                    ("アズマオウ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("ヤドン", 15, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("いてだきのどうくつ 入口", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("ヤドン", 15, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("いてだきのどうくつ 奥", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("ヒトデマン", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("おもいでのとう", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("テッポウオ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("ゴージャスリゾート", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("テッポウオ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("みずのめいろ", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("テッポウオ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("みずのさんぽみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("テッポウオ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("いせきのたに", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("ニョロモ", 15, 11),
                    ("ニョロゾ", 20, 11),
                    ("ギャラドス", 15, 11),
                    ("ヤドン", 15, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("みどりのさんぽみち", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("テッポウオ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("はずれのしま", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("テッポウオ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("トレーナータワー", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("テッポウオ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),
                new FRLGSuperRod("アスカナいせき", 20, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("クラブ", 15, 11),
                    ("テッポウオ", 15, 11),
                    ("ギャラドス", 15, 11),
                    ("キングラー", 25, 11),
                    ("ヤドン", 25, 11),
                })),

                };
            }
        }

        public static class RockSmash
        {
            public static GBAMap[] SelectMap(string mapNameKeyWord = "")
                => tables.Where(_ => _.MapName.Contains(mapNameKeyWord)).ToArray();

            private static readonly GBAMap[] tables;
            static RockSmash()
            {
                tables = new GBAMap[]
                {
                new FRLGRockSmash("イワヤマトンネル", 50, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 5, 16),
                    ("イシツブテ", 10, 11),
                    ("イシツブテ", 15, 16),
                    ("ゴローン", 25, 16),
                    ("ゴローン", 30, 11),
                })),
                new FRLGRockSmash("ハナダのどうくつ 1F", 50, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 30, 11),
                    ("ゴローン", 40, 11),
                    ("ゴローン", 45, 11),
                    ("イシツブテ", 40, 11),
                    ("イシツブテ", 40, 11),
                })),
                new FRLGRockSmash("ハナダのどうくつ 2F", 50, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 35, 11),
                    ("ゴローン", 45, 11),
                    ("ゴローン", 50, 11),
                    ("イシツブテ", 45, 11),
                    ("イシツブテ", 45, 11),
                })),
                new FRLGRockSmash("ハナダのどうくつ B1F", 50, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 40, 11),
                    ("ゴローン", 50, 11),
                    ("ゴローン", 55, 11),
                    ("イシツブテ", 50, 11),
                    ("イシツブテ", 50, 11),
                })),
                new FRLGRockSmash("ともしびやま 外/洞窟(左)", 50, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 5, 16),
                    ("イシツブテ", 10, 11),
                    ("イシツブテ", 15, 16),
                    ("ゴローン", 25, 16),
                    ("ゴローン", 30, 11),
                })),
                new FRLGRockSmash("ともしびやま 洞窟(右) 1F-B2F", 50, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 25, 11),
                    ("ゴローン", 30, 16),
                    ("ゴローン", 35, 16),
                    ("イシツブテ", 30, 11),
                    ("イシツブテ", 30, 11),
                })),
                new FRLGRockSmash("ともしびやま 洞窟(右) B3F", 50, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("マグマッグ", 15, 11),
                    ("マグマッグ", 25, 11),
                    ("マグカルゴ", 40, 6),
                    ("マグカルゴ", 35, 11),
                    ("マグカルゴ", 25, 11),
                })),
                new FRLGRockSmash("ほてりのみち", 25, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 5, 16),
                    ("イシツブテ", 10, 11),
                    ("イシツブテ", 15, 16),
                    ("ゴローン", 25, 16),
                    ("ゴローン", 30, 11),
                })),
                new FRLGRockSmash("しっぽうけいこく", 25, GBASlot.CreateTable(new (string, uint, uint)[]
                {
                    ("イシツブテ", 25, 11),
                    ("ゴローン", 30, 16),
                    ("ゴローン", 35, 16),
                    ("イシツブテ", 30, 11),
                    ("イシツブテ", 30, 11),
                })),

                };
            }
        }

    }
}
